#ifndef __CONSTANTS_OUTPUTS__
#define __CONSTANTS_OUTPUTS__

#define EKRAN_LIST_OUTPUTS_FOR_RANGUVANNJA        (EKRAN_LIST_INPUTS_FOR_RANGUVANNJA + 1)

#define EKRAN_RANGUVANNJA_OUTPUT_1                (EKRAN_RANGUVANNJA_INPUT_LAST + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_2                (EKRAN_RANGUVANNJA_OUTPUT_1 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_3                (EKRAN_RANGUVANNJA_OUTPUT_2 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_4                (EKRAN_RANGUVANNJA_OUTPUT_3 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_5                (EKRAN_RANGUVANNJA_OUTPUT_4 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_6                (EKRAN_RANGUVANNJA_OUTPUT_5 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_7                (EKRAN_RANGUVANNJA_OUTPUT_6 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_8                (EKRAN_RANGUVANNJA_OUTPUT_7 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_9                (EKRAN_RANGUVANNJA_OUTPUT_8 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_10               (EKRAN_RANGUVANNJA_OUTPUT_9 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_11               (EKRAN_RANGUVANNJA_OUTPUT_10 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_12               (EKRAN_RANGUVANNJA_OUTPUT_11 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_13               (EKRAN_RANGUVANNJA_OUTPUT_12 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_14               (EKRAN_RANGUVANNJA_OUTPUT_13 + 1)

#define EKRAN_RANGUVANNJA_OUTPUT_LAST             EKRAN_RANGUVANNJA_OUTPUT_14

#define MAX_ROW_LIST_OUTPUTS_FOR_RANGUVANNJA       (NUMBER_SIMPLE_OUTPUTS + ((current_settings.configuration & (1 << DS_BIT_CONFIGURATION)) != 0)*NUMBER_DS)
#define MAX_ROW_RANGUVANNJA_OUTPUT                 NUMBER_TOTAL_SIGNAL_FOR_RANG

#define NAME_RANG_RU    \
  "  Áëîê.âêë.ÂÂ   ",   \
  " Ñáðîñ èíäèêàöèè",   \
  "   Ñáðîñ ðåëå   ",   \
  " Ìåñòí./Äèñòàíö.",   \
  "  Ïîëîæåíèå ÂÂ  ",   \
  "Îòêë.îò âí.çàùèò",   \
  "     Âêë.ÂÂ     ",   \
  " Êîíòðîëü Âêë.  ",   \
  "    Îòêë.ÂÂ     ",   \
  " Êîíòðîëü Îòêë. ",   \
  "   Ïðèâîä ÂÂ    ",   \
  " Ïðåâ.Iîò.íîì.  ",   \
  " Êðèò.Ðåñóðñ ÂÂ ",   \
  " Èñ÷.Ðåñóðñ ÂÂ  ",   \
  "  Íåèñïð.Îáùàÿ  ",   \
  "  Íåèñïð.Àâàð.  ",   \
  " Ðàáîòà Àí.Ðåã. ",   \
  " Ðàáîòà Ä.Ðåã.  ",   \
  " Îòêë.îò çàùèò  ",   \
  "       ÁÎ       ",   \
  "       ÁÂ       ",   \
  " 1-ÿ ãð.óñòàâîê ",   \
  " 2-ÿ ãð.óñòàâîê ",   \
  " 3-ÿ ãð.óñòàâîê ",   \
  " 4-ÿ ãð.óñòàâîê ",   \
  " Èíâ.ÄÂ ãð.óñò. ",   \
  "Áëê.ãð.óñò.îò ç.",   \
  " Ñ.áëê.Ãîò.ê ÒÓ ",   \
  " Ãîòîâíîñòü ê ÒÓ",   \
  "  Èçì.íàñòðîåê  ",   \
  "   Áëîê.ÌÒÇ1    ",   \
  "   Áëîê.ÌÒÇ2    ",   \
  " Áëîê.óñê.ÌÒÇ2  ",   \
  "   Áëîê.ÌÒÇ3    ",   \
  "   Áëîê.ÌÒÇ4    ",   \
  " Ñåêò.ÌÒÇÍ1 Ïð. ",   \
  " Ñåêò.ÌÒÇÍ1 Îáð.",   \
  "    ÏÎ ÌÒÇ1     ",   \
  " ÏÎ ÌÒÇÍ1 Ïðÿìîé",   \
  " ÏÎ ÌÒÇÍ1 Îáð.  ",   \
  "  ÏÎ U ÌÒÇÏÍ1   ",   \
  "   ÏÎ ÌÒÇÏÍ1    ",   \
  "      ÌÒÇ1      ",   \
  " Ñåêò.ÌÒÇÍ2 Ïð. ",   \
  " Ñåêò.ÌÒÇÍ2 Îáð.",   \
  "    ÏÎ ÌÒÇ2     ",   \
  " ÏÎ ÌÒÇÍ2 Ïðÿìîé",   \
  " ÏÎ ÌÒÇÍ2 Îáð.  ",   \
  "  ÏÎ U ÌÒÇÏÍ2   ",   \
  "   ÏÎ ÌÒÇÏÍ2    ",   \
  "      ÌÒÇ2      ",   \
  " Ñåêò.ÌÒÇÍ3 Ïð. ",   \
  " Ñåêò.ÌÒÇÍ3 Îáð.",   \
  "    ÏÎ ÌÒÇ3     ",   \
  " ÏÎ ÌÒÇÍ3 Ïðÿìîé",   \
  " ÏÎ ÌÒÇÍ3 Îáð.  ",   \
  "  ÏÎ U ÌÒÇÏÍ3   ",   \
  "   ÏÎ ÌÒÇÏÍ3    ",   \
  "      ÌÒÇ3      ",   \
  " Ñåêò.ÌÒÇÍ4 Ïð. ",   \
  " Ñåêò.ÌÒÇÍ4 Îáð.",   \
  "    ÏÎ ÌÒÇ4     ",   \
  " ÏÎ ÌÒÇÍ4 Ïðÿìîé",   \
  " ÏÎ ÌÒÇÍ4 Îáð.  ",   \
  "  ÏÎ U ÌÒÇÏÍ4   ",   \
  "   ÏÎ ÌÒÇÏÍ4    ",   \
  "      ÌÒÇ4      ",   \
  " ÏÎ áëîê.U ÌÒÇÍ ",   \
  "    ÍÖÍ-ÌÒÇ     ",   \
  "Áëîê.ÌÒÇ 0.4êÂ 1",   \
  "Áëîê.ÌÒÇ 0.4êÂ 2",   \
  "Áë.ó.ÌÒÇ 0.4êÂ 2",   \
  " ÏÎ ÌÒÇ 0.4êÂ 1 ",   \
  "  ÌÒÇ 0.4êÂ 1   ",   \
  " ÏÎ ÌÒÇ 0.4êÂ 2 ",   \
  "  ÌÒÇ 0.4êÂ 2   ",   \
  "    Áëîê.ÇÄÇ    ",   \
  " Ïóñê ÇÄÇ îò ÄÂ ",   \
  " Ñâåò ÇÄÇ îò ÄÂ ",   \
  "     ÏÎ ÇÄÇ     ",   \
  "      ÇÄÇ       ",   \
  "    Áëîê.ÍÇÇ    ",   \
  "     ÏÎ ÍÇÇ     ",   \
  "      ÍÇÇ       ",   \
  "   ÏÎ ÇÇ(3I0)   ",   \
  "    ÇÇ(3I0)     ",   \
  "   ÏÎ ÇÇ(3U0)   ",   \
  "    ÇÇ(3U0)     ",   \
  "   Ñåêòîð ÍÇÇ   ",   \
  "   Áëîê.ÒÇÍÏ1   ",   \
  " Ñåêò.ÒÇÍÏ1 Ïð. ",   \
  " Ñåêò.ÒÇÍÏ1 Îáð.",   \
  "ÏÎ 3I0 ÒÇÍÏ1 Ïð.",   \
  "ÏÎ 3I0 ÒÇÍÏ1 Îáð",   \
  "ÏÎ 3U0 ÒÇÍÏ1 Ïð.",   \
  "ÏÎ 3U0 ÒÇÍÏ1 Îáð",   \
  "  ÏÎ ÒÇÍÏ1 Ïð.  ",   \
  " ÏÎ ÒÇÍÏ1 Îáð.  ",   \
  "     ÒÇÍÏ1      ",   \
  "   Áëîê.ÒÇÍÏ2   ",   \
  " Ñåêò.ÒÇÍÏ2 Ïð. ",   \
  " Ñåêò.ÒÇÍÏ2 Îáð.",   \
  "ÏÎ 3I0 ÒÇÍÏ2 Ïð.",   \
  "ÏÎ 3I0 ÒÇÍÏ2 Îáð",   \
  "ÏÎ 3U0 ÒÇÍÏ2 Ïð.",   \
  "ÏÎ 3U0 ÒÇÍÏ2 Îáð",   \
  "  ÏÎ ÒÇÍÏ2 Ïð.  ",   \
  " ÏÎ ÒÇÍÏ2 Îáð.  ",   \
  "     ÒÇÍÏ2      ",   \
  "   Áëîê.ÒÇÍÏ3   ",   \
  " Ñåêò.ÒÇÍÏ3 Ïð. ",   \
  " Ñåêò.ÒÇÍÏ3 Îáð.",   \
  "ÏÎ 3I0 ÒÇÍÏ3 Ïð.",   \
  "ÏÎ 3I0 ÒÇÍÏ3 Îáð",   \
  "ÏÎ 3U0 ÒÇÍÏ3 Ïð.",   \
  "ÏÎ 3U0 ÒÇÍÏ3 Îáð",   \
  "  ÏÎ ÒÇÍÏ3 Ïð.  ",   \
  " ÏÎ ÒÇÍÏ3 Îáð.  ",   \
  "     ÒÇÍÏ3      ",   \
  " Ñòàò.áëîê.ÀÏÂ  ",   \
  "      ÀÏÂ       ",   \
  "      ÀÏÂ2      ",   \
  "      ÀÏÂ3      ",   \
  "      ÀÏÂ4      ",   \
  "   Ðàáîòà ÀÏÂ   ",   \
  " À×Ð/×ÀÏÂ îò ÄÂ ",   \
  "   Áëîê.À×Ð1    ",   \
  "   Áëîê.À×Ð2    ",   \
  "   Ðàçð.×ÀÏÂ    ",   \
  "   Áëîê.×ÀÏÂ    ",   \
  "    ÏÎ À×Ð1     ",   \
  "    ÏÎ ×ÀÏÂ1    ",   \
  "   À×Ð/×ÀÏÂ1    ",   \
  "    ÏÎ À×Ð2     ",   \
  "    ÏÎ ×ÀÏÂ2    ",   \
  "   À×Ð/×ÀÏÂ2    ",   \
  " Ïóñê ÓÐÎÂ îò ÄÂ",   \
  "    ÏÎ ÓÐÎÂ     ",   \
  "     ÓÐÎÂ1      ",   \
  "     ÓÐÎÂ2      ",   \
  " Áëîê.ÇÎÏ(ÊÎÔ)  ",   \
  "  ÏÎ ÇÎÏ(ÊÎÔ)   ",   \
  "    ÇÎÏ(ÊÎÔ)    ",   \
  "  Áëîê.ÇÍìèí1   ",   \
  "  Ïóñê ÇÍìèí1   ",   \
  "  Áëîê.ÇÍìèí2   ",   \
  "  Ïóñê ÇÍìèí2   ",   \
  "   ÏÎ ÇÍìèí1    ",   \
  " ÏÎ Uáëê.ÇÍìèí1 ",   \
  " ÏÎ Iáëê.ÇÍìèí1 ",   \
  "     ÇÍìèí1     ",   \
  "     ÏÎ ÇÍìèí2  ",   \
  " ÏÎ Uáëê.ÇÍìèí2 ",   \
  " ÏÎ Iáëê.ÇÍìèí2 ",   \
  "     ÇÍìèí2     ",   \
  "  Áëîê.ÇÍìàêñ1  ",   \
  "   ÏÎ ÇÍìàêñ1   ",   \
  "    ÇÍìàêñ1     ",   \
  "  Áëîê.ÇÍìàêñ2  ",   \
  "   ÏÎ ÇÍìàêñ2   ",   \
  "    ÇÍìàêñ2     ",   \
  "    Áëîê.ÓÇx    ",   \
  "     ÏÎ ÓÇx     ",   \
  "      ÓÇx       ",   \
  " Âõ.Î-ôóíêöèè1  ",   \
  " Âûõ.Î-ôóíêöèè1 ",   \
  " Âõ.Î-ôóíêöèè2  ",   \
  " Âûõ.Î-ôóíêöèè2 ",   \
  " Âõ.Î-ôóíêöèè3  ",   \
  " Âûõ.Î-ôóíêöèè3 ",   \
  " Âõ.Î-ôóíêöèè4  ",   \
  " Âûõ.Î-ôóíêöèè4 ",   \
  " Âõ.Î-ôóíêöèè5  ",   \
  " Âûõ.Î-ôóíêöèè5 ",   \
  " Âõ.Î-ôóíêöèè6  ",   \
  " Âûõ.Î-ôóíêöèè6 ",   \
  " Âõ.Î-ôóíêöèè7  ",   \
  " Âûõ.Î-ôóíêöèè7 ",   \
  " Âõ.Î-ôóíêöèè8  ",   \
  " Âûõ.Î-ôóíêöèè8 ",   \
  " Óñò.Î-òðèããåðà1",   \
  " Ñáð.Î-òðèããåðà1",   \
  " Âûõ.Î-òðèããåðà1",   \
  " Óñò.Î-òðèããåðà2",   \
  " Ñáð.Î-òðèããåðà2",   \
  " Âûõ.Î-òðèããåðà2",   \
  " Óñò.Î-òðèããåðà3",   \
  " Ñáð.Î-òðèããåðà3",   \
  " Âûõ.Î-òðèããåðà3",   \
  " Óñò.Î-òðèããåðà4",   \
  " Ñáð.Î-òðèããåðà4",   \
  " Âûõ.Î-òðèããåðà4",   \
  "      Î-È1      ",   \
  "      Î-È2      ",   \
  "      Î-È3      ",   \
  "      Î-È4      ",   \
  "      Î-È5      ",   \
  "      Î-È6      ",   \
  "      Î-È7      ",   \
  "      Î-È8      ",   \
  "     Î-ÈËÈ1     ",   \
  "     Î-ÈËÈ2     ",   \
  "     Î-ÈËÈ3     ",   \
  "     Î-ÈËÈ4     ",   \
  "     Î-ÈËÈ5     ",   \
  "     Î-ÈËÈ6     ",   \
  "     Î-ÈËÈ7     ",   \
  "     Î-ÈËÈ8     ",   \
  "  Î-Èñêë.ÈËÈ1   ",   \
  "  Î-Èñêë.ÈËÈ2   ",   \
  "  Î-Èñêë.ÈËÈ3   ",   \
  "  Î-Èñêë.ÈËÈ4   ",   \
  "  Î-Èñêë.ÈËÈ5   ",   \
  "  Î-Èñêë.ÈËÈ6   ",   \
  "  Î-Èñêë.ÈËÈ7   ",   \
  "  Î-Èñêë.ÈËÈ8   ",   \
  "     Î-ÍÅ1      ",   \
  "     Î-ÍÅ2      ",   \
  "     Î-ÍÅ3      ",   \
  "     Î-ÍÅ4      ",   \
  "     Î-ÍÅ5      ",   \
  "     Î-ÍÅ6      ",   \
  "     Î-ÍÅ7      ",   \
  "     Î-ÍÅ8      ",   \
  "     Î-ÍÅ9      ",   \
  "     Î-ÍÅ10     ",   \
  "     Î-ÍÅ11     ",   \
  "     Î-ÍÅ12     ",   \
  "     Î-ÍÅ13     ",   \
  "     Î-ÍÅ14     ",   \
  "     Î-ÍÅ15     ",   \
  "     Î-ÍÅ16     ",   \
  " Îø.íàñòð.ð.ëîã."

#define NAME_RANG_UA    \
  " Áëîê.ââ³ìêí.ÂÂ ",   \
  " Ñêèä.³íäèêàö³¿ ",   \
  "   Ñêèä.ðåëå    ",   \
  " Ì³ñö./Äèñòàíö. ",   \
  "    Ñòàí ÂÂ     ",   \
  "Âèìê.â³ä çîâí.ç.",   \
  "    Ââ³ìê.ÂÂ    ",   \
  " Êîíòðîëü Ââ³ìê.",   \
  "    Âèìê.ÂÂ     ",   \
  " Êîíòðîëü Âèìê. ",   \
  "   Ïðèâ³ä ÂÂ    ",   \
  " Ïåðåâ.Iâ.íîì.  ",   \
  " Êðèò.Ðåñóðñ ÂÂ ",   \
  " Âè÷.Ðåñóðñ ÂÂ  ",   \
  " Íåñïð.Çàãàëüíà ",   \
  "  Íåñïð.Àâàð.   ",   \
  " Ðîá.Àí.Ðåºñòð. ",   \
  " Ðîá.Ä.Ðåºñòð.  ",   \
  " Âèìê.â³ä çàõ.  ",   \
  "     ÁÂèìê.     ",   \
  "    ÁÂâ³ìê.     ",   \
  " 1-à ãð.óñòàâîê ",   \
  " 2-à ãð.óñòàâîê ",   \
  " 3-à ãð.óñòàâîê ",   \
  " 4-à ãð.óñòàâîê ",   \
  " ²íâ.ÄÂ ãð.óñò. ",   \
  "Áë.ãð.óñò.â³ä ç.",   \
  " Ñ.áëê.Ãîò.äî ÒÓ",   \
  "Ãîòîâí³ñòü äî ÒÓ",   \
  " Çì.íàëàøòóâàííÿ",   \
  "   Áëîê.ÌÑÇ1    ",   \
  "   Áëîê.ÌÑÇ2    ",   \
  " Áëîê.ïðèñê.ÌÑÇ2",   \
  "   Áëîê.ÌÑÇ3    ",   \
  "   Áëîê.ÌÑÇ4    ",   \
  " Ñåêò.ÌÑÇÍ1 Ïð. ",   \
  " Ñåêò.ÌÑÇÍ1 Çâ. ",   \
  "    ÏÎ ÌÑÇ1     ",   \
  "  ÏÎ ÌÑÇÍ1 Ïð.  ",   \
  "  ÏÎ ÌÑÇÍ1 Çâ.  ",   \
  "  ÏÎ U ÌÑÇÏÍ1   ",   \
  "   ÏÎ ÌÑÇÏÍ1    ",   \
  "      ÌÑÇ1      ",   \
  " Ñåêò.ÌÑÇÍ2 Ïð. ",   \
  " Ñåêò.ÌÑÇÍ2 Çâ. ",   \
  "    ÏÎ ÌÑÇ2     ",   \
  "  ÏÎ ÌÑÇÍ2 Ïð.  ",   \
  "  ÏÎ ÌÑÇÍ2 Çâ.  ",   \
  "  ÏÎ U ÌÑÇÏÍ2   ",   \
  "   ÏÎ ÌÑÇÏÍ2    ",   \
  "      ÌÑÇ2      ",   \
  " Ñåêò.ÌÑÇÍ3 Ïð. ",   \
  " Ñåêò.ÌÑÇÍ3 Çâ. ",   \
  "    ÏÎ ÌÑÇ3     ",   \
  "  ÏÎ ÌÑÇÍ3 Ïð.  ",   \
  "  ÏÎ ÌÑÇÍ3 Çâ.  ",   \
  "  ÏÎ U ÌÑÇÏÍ3   ",   \
  "   ÏÎ ÌÑÇÏÍ3    ",   \
  "      ÌÑÇ3      ",   \
  " Ñåêò.ÌÑÇÍ4 Ïð. ",   \
  " Ñåêò.ÌÑÇÍ4 Çâ. ",   \
  "    ÏÎ ÌÑÇ4     ",   \
  "  ÏÎ ÌÑÇÍ4 Ïð.  ",   \
  "  ÏÎ ÌÑÇÍ4 Çâ.  ",   \
  "  ÏÎ U ÌÑÇÏÍ4   ",   \
  "   ÏÎ ÌÑÇÏÍ4    ",   \
  "      ÌÑÇ4      ",   \
  " ÏÎ áëîê.U ÌÑÇÍ ",   \
  "    ÍÊÍ-ÌÑÇ     ",   \
  "Áëîê.ÌÑÇ 0.4êÂ 1",   \
  "Áëîê.ÌÑÇ 0.4êÂ 2",   \
  "Áë.ï.ÌÑÇ 0.4êÂ 2",   \
  " ÏÎ ÌÑÇ 0.4êÂ 1 ",   \
  "  ÌÑÇ 0.4êÂ 1   ",   \
  " ÏÎ ÌÑÇ 0.4êÂ 2 ",   \
  "  ÌÑÇ 0.4êÂ 2   ",   \
  "    Áëîê.ÇÄÇ    ",   \
  " Ïóñê ÇÄÇ â³ä ÄÂ",   \
  " Ñâ.ÇÄÇ â³ä ÄÂ  ",   \
  "     ÏÎ ÇÄÇ     ",   \
  "      ÇÄÇ       ",   \
  "    Áëîê.ÍÇÇ    ",   \
  "     ÏÎ ÍÇÇ     ",   \
  "      ÍÇÇ       ",   \
  "   ÏÎ ÇÇ(3I0)   ",   \
  "    ÇÇ(3I0)     ",   \
  "   ÏÎ ÇÇ(3U0)   ",   \
  "    ÇÇ(3U0)     ",   \
  "   Ñåêòîð ÍÇÇ   ",   \
  "   Áëîê.ÑÇÍÏ1   ",   \
  " Ñåêò.ÑÇÍÏ1 Ïð. ",   \
  " Ñåêò.ÑÇÍÏ1 Çâ. ",   \
  "ÏÎ 3I0 ÑÇÍÏ1 Ïð.",   \
  "ÏÎ 3I0 ÑÇÍÏ1 Çâ.",   \
  "ÏÎ 3U0 ÑÇÍÏ1 Ïð.",   \
  "ÏÎ 3U0 ÑÇÍÏ1 Çâ.",   \
  "  ÏÎ ÑÇÍÏ1 Ïð.  ",   \
  "  ÏÎ ÑÇÍÏ1 Çâ.  ",   \
  "     ÑÇÍÏ1      ",   \
  "   Áëîê.ÑÇÍÏ2   ",   \
  " Ñåêò.ÑÇÍÏ2 Ïð. ",   \
  " Ñåêò.ÑÇÍÏ2 Çâ. ",   \
  "ÏÎ 3I0 ÑÇÍÏ2 Ïð.",   \
  "ÏÎ 3I0 ÑÇÍÏ2 Çâ.",   \
  "ÏÎ 3U0 ÑÇÍÏ2 Ïð.",   \
  "ÏÎ 3U0 ÑÇÍÏ2 Çâ.",   \
  "  ÏÎ ÑÇÍÏ2 Ïð.  ",   \
  "  ÏÎ ÑÇÍÏ2 Çâ.  ",   \
  "     ÑÇÍÏ2      ",   \
  "   Áëîê.ÑÇÍÏ3   ",   \
  " Ñåêò.ÑÇÍÏ3 Ïð. ",   \
  " Ñåêò.ÑÇÍÏ3 Çâ. ",   \
  "ÏÎ 3I0 ÑÇÍÏ3 Ïð.",   \
  "ÏÎ 3I0 ÑÇÍÏ3 Çâ.",   \
  "ÏÎ 3U0 ÑÇÍÏ3 Ïð.",   \
  "ÏÎ 3U0 ÑÇÍÏ3 Çâ.",   \
  "  ÏÎ ÑÇÍÏ3 Ïð.  ",   \
  "  ÏÎ ÑÇÍÏ3 Çâ.  ",   \
  "     ÑÇÍÏ3      ",   \
  " Ñòàò.áëîê.ÀÏÂ  ",   \
  "      ÀÏÂ       ",   \
  "      ÀÏÂ2      ",   \
  "      ÀÏÂ3      ",   \
  "      ÀÏÂ4      ",   \
  "   Ðîáîòà ÀÏÂ   ",   \
  " À×Ð/×ÀÏÂ â³ä ÄÂ",   \
  "   Áëîê.À×Ð1    ",   \
  "   Áëîê.À×Ð2    ",   \
  "  Äîçâ³ë ×ÀÏÂ   ",   \
  "   Áëîê.×ÀÏÂ    ",   \
  "    ÏÎ À×Ð1     ",   \
  "    ÏÎ ×ÀÏÂ1    ",   \
  "   À×Ð/×ÀÏÂ1    ",   \
  "    ÏÎ À×Ð2     ",   \
  "    ÏÎ ×ÀÏÂ2    ",   \
  "   À×Ð/×ÀÏÂ2    ",   \
  "Ïóñê ÏÐÂÂ â³ä ÄÂ",   \
  "    ÏÎ ÏÐÂÂ     ",   \
  "     ÏÐÂÂ1      ",   \
  "     ÏÐÂÂ2      ",   \
  " Áëîê.ÇÇÏ(ÊÎÔ)  ",   \
  "  ÏÎ ÇÇÏ(ÊÎÔ)   ",   \
  "    ÇÇÏ(ÊÎÔ)    ",   \
  "  Áëîê.ÇÍì³í1   ",   \
  "  Ïóñê ÇÍì³í1   ",   \
  "  Áëîê.ÇÍì³í2   ",   \
  "  Ïóñê ÇÍì³í2   ",   \
  "   ÏÎ ÇÍì³í1    ",   \
  " ÏÎ Uáëê.ÇÍì³í1 ",   \
  " ÏÎ Iáëê.ÇÍì³í1 ",   \
  "     ÇÍì³í1     ",   \
  "     ÏÎ ÇÍì³í2  ",   \
  " ÏÎ Uáëê.ÇÍì³í2 ",   \
  " ÏÎ Iáëê.ÇÍì³í2 ",   \
  "     ÇÍì³í2     ",   \
  "  Áëîê.ÇÍìàêñ1  ",   \
  "   ÏÎ ÇÍìàêñ1   ",   \
  "    ÇÍìàêñ1     ",   \
  "  Áëîê.ÇÍìàêñ2  ",   \
  "   ÏÎ ÇÍìàêñ2   ",   \
  "    ÇÍìàêñ2     ",   \
  "    Áëîê.ÓÇx    ",   \
  "     ÏÎ ÓÇx     ",   \
  "      ÓÇx       ",   \
  " Âõ.Â-ôóíêö³¿1  ",   \
  " Âèõ.Â-ôóíêö³¿1 ",   \
  " Âõ.Â-ôóíêö³¿2  ",   \
  " Âèõ.Â-ôóíêö³¿2 ",   \
  " Âõ.Â-ôóíêö³¿3  ",   \
  " Âèõ.Â-ôóíêö³¿3 ",   \
  " Âõ.Â-ôóíêö³¿4  ",   \
  " Âèõ.Â-ôóíêö³¿4 ",   \
  " Âõ.Â-ôóíêö³¿5  ",   \
  " Âèõ.Â-ôóíêö³¿5 ",   \
  " Âõ.Â-ôóíêö³¿6  ",   \
  " Âèõ.Â-ôóíêö³¿6 ",   \
  " Âõ.Â-ôóíêö³¿7  ",   \
  " Âèõ.Â-ôóíêö³¿7 ",   \
  " Âõ.Â-ôóíêö³¿8  ",   \
  " Âèõ.Â-ôóíêö³¿8 ",   \
  " Âñò.Â-òðè´åðà1 ",   \
  " Ñê.Â-òðè´åðà1  ",   \
  " Âèõ.Â-òðè´åðà1 ",   \
  " Âñò.Â-òðè´åðà2 ",   \
  " Ñê.Â-òðè´åðà2  ",   \
  " Âèõ.Â-òðè´åðà2 ",   \
  " Âñò.Â-òðè´åðà3 ",   \
  " Ñê.Â-òðè´åðà3  ",   \
  " Âèõ.Â-òðè´åðà3 ",   \
  " Âñò.Â-òðè´åðà4 ",   \
  " Ñê.Â-òðè´åðà4  ",   \
  " Âèõ.Â-òðè´åðà4 ",   \
  "      Â-²1      ",   \
  "      Â-²2      ",   \
  "      Â-²3      ",   \
  "      Â-²4      ",   \
  "      Â-²5      ",   \
  "      Â-²6      ",   \
  "      Â-²7      ",   \
  "      Â-²8      ",   \
  "     Â-ÀÁÎ1     ",   \
  "     Â-ÀÁÎ2     ",   \
  "     Â-ÀÁÎ3     ",   \
  "     Â-ÀÁÎ4     ",   \
  "     Â-ÀÁÎ5     ",   \
  "     Â-ÀÁÎ6     ",   \
  "     Â-ÀÁÎ7     ",   \
  "     Â-ÀÁÎ8     ",   \
  "  Â-Âèêë.ÀÁÎ1   ",   \
  "  Â-Âèêë.ÀÁÎ2   ",   \
  "  Â-Âèêë.ÀÁÎ3   ",   \
  "  Â-Âèêë.ÀÁÎ4   ",   \
  "  Â-Âèêë.ÀÁÎ5   ",   \
  "  Â-Âèêë.ÀÁÎ6   ",   \
  "  Â-Âèêë.ÀÁÎ7   ",   \
  "  Â-Âèêë.ÀÁÎ8   ",   \
  "     Â-ÍÅ1      ",   \
  "     Â-ÍÅ2      ",   \
  "     Â-ÍÅ3      ",   \
  "     Â-ÍÅ4      ",   \
  "     Â-ÍÅ5      ",   \
  "     Â-ÍÅ6      ",   \
  "     Â-ÍÅ7      ",   \
  "     Â-ÍÅ8      ",   \
  "     Â-ÍÅ9      ",   \
  "     Â-ÍÅ10     ",   \
  "     Â-ÍÅ11     ",   \
  "     Â-ÍÅ12     ",   \
  "     Â-ÍÅ13     ",   \
  "     Â-ÍÅ14     ",   \
  "     Â-ÍÅ15     ",   \
  "     Â-ÍÅ16     ",   \
  " Ïîì.íàë.ð.ëîã. "
    
#define NAME_RANG_EN    \
  "  CB Close Blk  ",   \
  "   LED Reset    ",   \
  "  Relay Reset   ",   \
  "  Local/Remote  ",   \
  "    CB State    ",   \
  " Ext CB Open Cmd",   \
  "  Close CB Cmd  ",   \
  " CB Op Circ Ctl ",   \
  "  Open CB Cmd   ",   \
  " CB Cl Circ Ctl ",   \
  "  CB Actuator   ",   \
  "Rat Trip Cur Exc",   \
  "  CB crit res   ",   \
  "   CB res exh   ",   \
  " General fault  ",   \
  " Emergence Fault",   \
  " Dst Rec InPro  ",   \
  " Bin Rec InPro  ",   \
  " Trip via Prot  ",   \
  "  Open CB Com   ",   \
  "  Close CB Com  ",   \
  " SetPoints gr-1 ",   \
  " SetPoints gr-2 ",   \
  " SetPoints gr-3 ",   \
  " SetPoints gr-4 ",   \
  "SP gr chg BI pre",   \
  " SP gr chg Blk  ",   \
  "Rem Ctr R Bl Res",   \
  "  Rem Ctl Ena   ",   \
  " Settings change",   \
  "    OCP1 Blk    ",   \
  "    OCP2 Blk    ",   \
  "  OCP2 Acc Blk  ",   \
  "    OCP3 Blk    ",   \
  "    OCP4 Blk    ",   \
  "  DOCP1 Fw Sec  ",   \
  "  DOCP1 Bw Sec  ",   \
  "   OCP1 Start   ",   \
  " DOCP1 Fw Start ",   \
  " DOCP1 Bw Start ",   \
  " VOCP1 U Start  ",   \
  "  VOCP1 Start   ",   \
  "    OCP1 Op     ",   \
  "  DOCP2 Fw Sec  ",   \
  "  DOCP2 Bw Sec  ",   \
  "   OCP2 Start   ",   \
  " DOCP2 Fw Start ",   \
  " DOCP2 Bw Start ",   \
  " VOCP2 U Start  ",   \
  "  VOCP2 Start   ",   \
  "    OCP2 Op     ",   \
  "  DOCP3 Fw Sec  ",   \
  "  DOCP3 Bw Sec  ",   \
  "   OCP3 Start   ",   \
  " DOCP3 Fw Start ",   \
  " DOCP3 Bw Start ",   \
  " VOCP3 U Start  ",   \
  "  VOCP3 Start   ",   \
  "    OCP3 Op     ",   \
  "  DOCP4 Fw Sec  ",   \
  "  DOCP4 Bw Sec  ",   \
  "   OCP4 Start   ",   \
  " DOCP4 Fw Start ",   \
  " DOCP4 Bw Start ",   \
  " VOCP4 U Start  ",   \
  "  VOCP4 Start   ",   \
  "    OCP4 Op     ",   \
  "   OCP U Blk    ",   \
  " OCP U Malfunc  ",   \
  "   LVOCP1 Blk   ",   \
  "   LVOCP2 Blk   ",   \
  " LVOCP2 acc Blk ",   \
  "  LVOCP1 Start  ",   \
  "   LVOCP1 Op    ",   \
  "  LVOCP2 Start  ",   \
  "   LVOCP2 Op    ",   \
  "    AFD Blk     ",   \
  "AFD via BI Start",   \
  " AFD via BI St  ",   \
  "   AFD Start    ",   \
  "     AFD Op     ",   \
  "   SDEFP Blk    ",   \
  "  SDEFP Start   ",   \
  "    SDEFP Op    ",   \
  "  SEFOCP Start  ",   \
  "   SEFOCP Op    ",   \
  "  SEFOVP Start  ",   \
  "   SEFOVP Op    ",   \
  "   SDEFP Sec    ",   \
  "   DEFP1 Blk    ",   \
  "  DEFP1 Sec Fw  ",   \
  "  DEFP1 Sec Bw  ",   \
  " DEFP3I01 Fw St ",   \
  " DEFP3I01 Bw St ",   \
  " DEFP3U01 Fw St ",   \
  " DEFP3U01 Bw St ",   \
  " DEFP1 Fw Start ",   \
  " DEFP1 Bw Start ",   \
  "    DEFP1 Op    ",   \
  "   DEFP2 Blk    ",   \
  "  DEFP2 Sec Fw  ",   \
  "  DEFP2 Sec Bw  ",   \
  " DEFP3I02 Fw St ",   \
  " DEFP3I02 Bw St ",   \
  " DEFP3U02 Fw St ",   \
  " DEFP3U02 Bw St ",   \
  " DEFP2 Fw Start ",   \
  " DEFP2 Bw Start ",   \
  "    DEFP2 Op    ",   \
  "   DEFP3 Blk    ",   \
  "  DEFP3 Sec Fw  ",   \
  "  DEFP3 Sec Bw  ",   \
  " DEFP3I03 Fw St ",   \
  " DEFP3I03 Bw St ",   \
  " DEFP3U03 Fw St ",   \
  " DEFP3U03 Bw St ",   \
  " DEFP3 Fw Start ",   \
  " DEFP3 Bw Start ",   \
  "    DEFP3 Op    ",   \
  "     AR Blk     ",   \
  "   AR Cycle 1   ",   \
  "   AR Cycle 2   ",   \
  "   AR Cycle 3   ",   \
  "   AR Cycle 4   ",   \
  "    AR InPro    ",   \
  " LFÑ/FAR vBI St ",   \
  "    LFÑ1 Blk    ",   \
  "    LFÑ2 Blk    ",   \
  "    FAR Ena     ",   \
  "    FAR Blk     ",   \
  "   LFÑ1 Start   ",   \
  "   FAR1 Start   ",   \
  "   LFÑ/FAR 1    ",   \
  "   LFÑ2 Start   ",   \
  "   FAR2 Start   ",   \
  "   LFÑ/FAR 2    ",   \
  " CBF vBI Start  ",   \
  "   CBF Start    ",   \
  "   CBF In Op    ",   \
  "   CBF Ex Op    ",   \
  "   NSOCP Blk    ",   \
  "  NSOCP Start   ",   \
  "    NSOCP Op    ",   \
  "    UVP1 Blk    ",   \
  " UVP1 vBI Start ",   \
  "    UVP2 Blk    ",   \
  " UVP2 vBI Start ",   \
  "   UVP1 Start   ",   \
  "   UVP1 UBlk    ",   \
  "   UVP1 IBlk    ",   \
  "    UVP1 Op     ",   \
  "   UVP2 Start   ",   \
  "   UVP2 UBlk    ",   \
  "   UVP2 IBlk    ",   \
  "    UVP2 Op     ",   \
  "    OVP1 Blk    ",   \
  "   OVP1 Start   ",   \
  "    OVP1 Op     ",   \
  "    OVP2 Blk    ",   \
  "   OVP2 Start   ",   \
  "    OVP2 Op     ",   \
  "   MFPx Block   ",   \
  "   MFPx Start   ",   \
  "      MFPx      ",   \
  "  UD-Func 1 In  ",   \
  " UD-Func 1 Out  ",   \
  "  UD-Func 2 In  ",   \
  " UD-Func 2 Out  ",   \
  "  UD-Func 3 In  ",   \
  " UD-Func 3 Out  ",   \
  "  UD-Func 4 In  ",   \
  " UD-Func 4 Out  ",   \
  "  UD-Func 5 In  ",   \
  " UD-Func 5 Out  ",   \
  "  UD-Func 6 In  ",   \
  " UD-Func 6 Out  ",   \
  "  UD-Func 7 In  ",   \
  " UD-Func 7 Out  ",   \
  "  UD-Func 8 In  ",   \
  " UD-Func 8 Out  ",   \
  "  UD-FF 1 Set   ",   \
  " UD-FF 1 Reset  ",   \
  "  UD-FF 1 Out   ",   \
  "  UD-FF 2 Set   ",   \
  " UD-FF 2 Reset  ",   \
  "  UD-FF 2 Out   ",   \
  "  UD-FF 3 Set   ",   \
  " UD-FF 3 Reset  ",   \
  "  UD-FF 3 Out   ",   \
  "  UD-FF 4 Set   ",   \
  " UD-FF 4 Reset  ",   \
  "  UD-FF 4 Out   ",   \
  "     AND 1      ",   \
  "     AND 2      ",   \
  "     AND 3      ",   \
  "     AND 4      ",   \
  "     AND 5      ",   \
  "     AND 6      ",   \
  "     AND 7      ",   \
  "     AND 8      ",   \
  "      OR 1      ",   \
  "      OR 2      ",   \
  "      OR 3      ",   \
  "      OR 4      ",   \
  "      OR 5      ",   \
  "      OR 6      ",   \
  "      OR 7      ",   \
  "      OR 8      ",   \
  "     XOR 1      ",   \
  "     XOR 2      ",   \
  "     XOR 3      ",   \
  "     XOR 4      ",   \
  "     XOR 5      ",   \
  "     XOR 6      ",   \
  "     XOR 7      ",   \
  "     XOR 8      ",   \
  "     NOT 1      ",   \
  "     NOT 2      ",   \
  "     NOT 3      ",   \
  "     NOT 4      ",   \
  "     NOT 5      ",   \
  "     NOT 6      ",   \
  "     NOT 7      ",   \
  "     NOT 8      ",   \
  "     NOT 9      ",   \
  "     NOT 10     ",   \
  "     NOT 11     ",   \
  "     NOT 12     ",   \
  "     NOT 13     ",   \
  "     NOT 14     ",   \
  "     NOT 15     ",   \
  "     NOT 16     ",   \
  "  UD-Logic Er   "

#define NAME_RANG_KZ    \
  "  Áëîê.âêë.ÂÂ   ",   \
  " Ñáðîñ èíäèêàöèè",   \
  "   Ñáðîñ ðåëå   ",   \
  " Ìåñòí./Äèñòàíö.",   \
  "  Ïîëîæåíèå ÂÂ  ",   \
  "Îòêë.îò âí.çàùèò",   \
  "     Âêë.ÂÂ     ",   \
  " Êîíòðîëü Âêë.  ",   \
  "    Îòêë.ÂÂ     ",   \
  " Êîíòðîëü Îòêë. ",   \
  "   Ïðèâîä ÂÂ    ",   \
  " Ïðåâ.Iîò.íîì.  ",   \
  " Êðèò.Ðåñóðñ ÂÂ ",   \
  " Èñ÷.Ðåñóðñ ÂÂ  ",   \
  "  Íåèñïð.Îáùàÿ  ",   \
  "  Íåèñïð.Àâàð.  ",   \
  " Ðàáîòà Àí.Ðåã. ",   \
  " Ðàáîòà Ä.Ðåã.  ",   \
  " Îòêë.îò çàùèò  ",   \
  "       ÁÎ       ",   \
  "       ÁÂ       ",   \
  " 1-ÿ ãð.óñòàâîê ",   \
  " 2-ÿ ãð.óñòàâîê ",   \
  " 3-ÿ ãð.óñòàâîê ",   \
  " 4-ÿ ãð.óñòàâîê ",   \
  " Èíâ.ÄÂ ãð.óñò. ",   \
  "Áëê.ãð.óñò.îò ç.",   \
  " Ñ.áëê.Ãîò.ê ÒÓ ",   \
  " Ãîòîâíîñòü ê ÒÓ",   \
  "  Èçì.íàñòðîåê  ",   \
  "   Áëîê.ÌÒÇ1    ",   \
  "   Áëîê.ÌÒÇ2    ",   \
  " Áëîê.óñê.ÌÒÇ2  ",   \
  "   Áëîê.ÌÒÇ3    ",   \
  "   Áëîê.ÌÒÇ4    ",   \
  " Ñåêò.ÌÒÇÍ1 Ïð. ",   \
  " Ñåêò.ÌÒÇÍ1 Îáð.",   \
  "    ÏÎ ÌÒÇ1     ",   \
  " ÏÎ ÌÒÇÍ1 Ïðÿìîé",   \
  " ÏÎ ÌÒÇÍ1 Îáð.  ",   \
  "  ÏÎ U ÌÒÇÏÍ1   ",   \
  "   ÏÎ ÌÒÇÏÍ1    ",   \
  "      ÌÒÇ1      ",   \
  " Ñåêò.ÌÒÇÍ2 Ïð. ",   \
  " Ñåêò.ÌÒÇÍ2 Îáð.",   \
  "    ÏÎ ÌÒÇ2     ",   \
  " ÏÎ ÌÒÇÍ2 Ïðÿìîé",   \
  " ÏÎ ÌÒÇÍ2 Îáð.  ",   \
  "  ÏÎ U ÌÒÇÏÍ2   ",   \
  "   ÏÎ ÌÒÇÏÍ2    ",   \
  "      ÌÒÇ2      ",   \
  " Ñåêò.ÌÒÇÍ3 Ïð. ",   \
  " Ñåêò.ÌÒÇÍ3 Îáð.",   \
  "    ÏÎ ÌÒÇ3     ",   \
  " ÏÎ ÌÒÇÍ3 Ïðÿìîé",   \
  " ÏÎ ÌÒÇÍ3 Îáð.  ",   \
  "  ÏÎ U ÌÒÇÏÍ3   ",   \
  "   ÏÎ ÌÒÇÏÍ3    ",   \
  "      ÌÒÇ3      ",   \
  " Ñåêò.ÌÒÇÍ4 Ïð. ",   \
  " Ñåêò.ÌÒÇÍ4 Îáð.",   \
  "    ÏÎ ÌÒÇ4     ",   \
  " ÏÎ ÌÒÇÍ4 Ïðÿìîé",   \
  " ÏÎ ÌÒÇÍ4 Îáð.  ",   \
  "  ÏÎ U ÌÒÇÏÍ4   ",   \
  "   ÏÎ ÌÒÇÏÍ4    ",   \
  "      ÌÒÇ4      ",   \
  " ÏÎ áëîê.U ÌÒÇÍ ",   \
  "    ÍÖÍ-ÌÒÇ     ",   \
  "Áëîê.ÌÒÇ 0.4êÂ 1",   \
  "Áëîê.ÌÒÇ 0.4êÂ 2",   \
  "Áë.ó.ÌÒÇ 0.4êÂ 2",   \
  " ÏÎ ÌÒÇ 0.4êÂ 1 ",   \
  "  ÌÒÇ 0.4êÂ 1   ",   \
  " ÏÎ ÌÒÇ 0.4êÂ 2 ",   \
  "  ÌÒÇ 0.4êÂ 2   ",   \
  "    Áëîê.ÇÄÇ    ",   \
  " Ïóñê ÇÄÇ îò ÄÂ ",   \
  " Ñâåò ÇÄÇ îò ÄÂ ",   \
  "     ÏÎ ÇÄÇ     ",   \
  "      ÇÄÇ       ",   \
  "    Áëîê.ÍÇÇ    ",   \
  "     ÏÎ ÍÇÇ     ",   \
  "      ÍÇÇ       ",   \
  "   ÏÎ ÇÇ(3I0)   ",   \
  "    ÇÇ(3I0)     ",   \
  "   ÏÎ ÇÇ(3U0)   ",   \
  "    ÇÇ(3U0)     ",   \
  "   Ñåêòîð ÍÇÇ   ",   \
  "   Áëîê.ÒÇÍÏ1   ",   \
  " Ñåêò.ÒÇÍÏ1 Ïð. ",   \
  " Ñåêò.ÒÇÍÏ1 Îáð.",   \
  "ÏÎ 3I0 ÒÇÍÏ1 Ïð.",   \
  "ÏÎ 3I0 ÒÇÍÏ1 Îáð",   \
  "ÏÎ 3U0 ÒÇÍÏ1 Ïð.",   \
  "ÏÎ 3U0 ÒÇÍÏ1 Îáð",   \
  "  ÏÎ ÒÇÍÏ1 Ïð.  ",   \
  " ÏÎ ÒÇÍÏ1 Îáð.  ",   \
  "     ÒÇÍÏ1      ",   \
  "   Áëîê.ÒÇÍÏ2   ",   \
  " Ñåêò.ÒÇÍÏ2 Ïð. ",   \
  " Ñåêò.ÒÇÍÏ2 Îáð.",   \
  "ÏÎ 3I0 ÒÇÍÏ2 Ïð.",   \
  "ÏÎ 3I0 ÒÇÍÏ2 Îáð",   \
  "ÏÎ 3U0 ÒÇÍÏ2 Ïð.",   \
  "ÏÎ 3U0 ÒÇÍÏ2 Îáð",   \
  "  ÏÎ ÒÇÍÏ2 Ïð.  ",   \
  " ÏÎ ÒÇÍÏ2 Îáð.  ",   \
  "     ÒÇÍÏ2      ",   \
  "   Áëîê.ÒÇÍÏ3   ",   \
  " Ñåêò.ÒÇÍÏ3 Ïð. ",   \
  " Ñåêò.ÒÇÍÏ3 Îáð.",   \
  "ÏÎ 3I0 ÒÇÍÏ3 Ïð.",   \
  "ÏÎ 3I0 ÒÇÍÏ3 Îáð",   \
  "ÏÎ 3U0 ÒÇÍÏ3 Ïð.",   \
  "ÏÎ 3U0 ÒÇÍÏ3 Îáð",   \
  "  ÏÎ ÒÇÍÏ3 Ïð.  ",   \
  " ÏÎ ÒÇÍÏ3 Îáð.  ",   \
  "     ÒÇÍÏ3      ",   \
  " Ñòàò.áëîê.ÀÏÂ  ",   \
  "      ÀÏÂ       ",   \
  "      ÀÏÂ2      ",   \
  "      ÀÏÂ3      ",   \
  "      ÀÏÂ4      ",   \
  "   Ðàáîòà ÀÏÂ   ",   \
  " À×Ð/×ÀÏÂ îò ÄÂ ",   \
  "   Áëîê.À×Ð1    ",   \
  "   Áëîê.À×Ð2    ",   \
  "   Ðàçð.×ÀÏÂ    ",   \
  "   Áëîê.×ÀÏÂ    ",   \
  "    ÏÎ À×Ð1     ",   \
  "    ÏÎ ×ÀÏÂ1    ",   \
  "   À×Ð/×ÀÏÂ1    ",   \
  "    ÏÎ À×Ð2     ",   \
  "    ÏÎ ×ÀÏÂ2    ",   \
  "   À×Ð/×ÀÏÂ2    ",   \
  " Ïóñê ÓÐÎÂ îò ÄÂ",   \
  "    ÏÎ ÓÐÎÂ     ",   \
  "     ÓÐÎÂ1      ",   \
  "     ÓÐÎÂ2      ",   \
  " Áëîê.ÇÎÏ(ÊÎÔ)  ",   \
  "  ÏÎ ÇÎÏ(ÊÎÔ)   ",   \
  "    ÇÎÏ(ÊÎÔ)    ",   \
  "  Áëîê.ÇÍìèí1   ",   \
  "  Ïóñê ÇÍìèí1   ",   \
  "  Áëîê.ÇÍìèí2   ",   \
  "  Ïóñê ÇÍìèí2   ",   \
  "   ÏÎ ÇÍìèí1    ",   \
  " ÏÎ Uáëê.ÇÍìèí1 ",   \
  " ÏÎ Iáëê.ÇÍìèí1 ",   \
  "     ÇÍìèí1     ",   \
  "     ÏÎ ÇÍìèí2  ",   \
  " ÏÎ Uáëê.ÇÍìèí2 ",   \
  " ÏÎ Iáëê.ÇÍìèí2 ",   \
  "     ÇÍìèí2     ",   \
  "  Áëîê.ÇÍìàêñ1  ",   \
  "   ÏÎ ÇÍìàêñ1   ",   \
  "    ÇÍìàêñ1     ",   \
  "  Áëîê.ÇÍìàêñ2  ",   \
  "   ÏÎ ÇÍìàêñ2   ",   \
  "    ÇÍìàêñ2     ",   \
  "    Áëîê.ÓÇx    ",   \
  "     ÏÎ ÓÇx     ",   \
  "      ÓÇx       ",   \
  " Âõ.Î-ôóíêöèè1  ",   \
  " Âûõ.Î-ôóíêöèè1 ",   \
  " Âõ.Î-ôóíêöèè2  ",   \
  " Âûõ.Î-ôóíêöèè2 ",   \
  " Âõ.Î-ôóíêöèè3  ",   \
  " Âûõ.Î-ôóíêöèè3 ",   \
  " Âõ.Î-ôóíêöèè4  ",   \
  " Âûõ.Î-ôóíêöèè4 ",   \
  " Âõ.Î-ôóíêöèè5  ",   \
  " Âûõ.Î-ôóíêöèè5 ",   \
  " Âõ.Î-ôóíêöèè6  ",   \
  " Âûõ.Î-ôóíêöèè6 ",   \
  " Âõ.Î-ôóíêöèè7  ",   \
  " Âûõ.Î-ôóíêöèè7 ",   \
  " Âõ.Î-ôóíêöèè8  ",   \
  " Âûõ.Î-ôóíêöèè8 ",   \
  " Óñò.Î-òðèããåðà1",   \
  " Ñáð.Î-òðèããåðà1",   \
  " Âûõ.Î-òðèããåðà1",   \
  " Óñò.Î-òðèããåðà2",   \
  " Ñáð.Î-òðèããåðà2",   \
  " Âûõ.Î-òðèããåðà2",   \
  " Óñò.Î-òðèããåðà3",   \
  " Ñáð.Î-òðèããåðà3",   \
  " Âûõ.Î-òðèããåðà3",   \
  " Óñò.Î-òðèããåðà4",   \
  " Ñáð.Î-òðèããåðà4",   \
  " Âûõ.Î-òðèããåðà4",   \
  "      Î-È1      ",   \
  "      Î-È2      ",   \
  "      Î-È3      ",   \
  "      Î-È4      ",   \
  "      Î-È5      ",   \
  "      Î-È6      ",   \
  "      Î-È7      ",   \
  "      Î-È8      ",   \
  "     Î-ÈËÈ1     ",   \
  "     Î-ÈËÈ2     ",   \
  "     Î-ÈËÈ3     ",   \
  "     Î-ÈËÈ4     ",   \
  "     Î-ÈËÈ5     ",   \
  "     Î-ÈËÈ6     ",   \
  "     Î-ÈËÈ7     ",   \
  "     Î-ÈËÈ8     ",   \
  "  Î-Èñêë.ÈËÈ1   ",   \
  "  Î-Èñêë.ÈËÈ2   ",   \
  "  Î-Èñêë.ÈËÈ3   ",   \
  "  Î-Èñêë.ÈËÈ4   ",   \
  "  Î-Èñêë.ÈËÈ5   ",   \
  "  Î-Èñêë.ÈËÈ6   ",   \
  "  Î-Èñêë.ÈËÈ7   ",   \
  "  Î-Èñêë.ÈËÈ8   ",   \
  "     Î-ÍÅ1      ",   \
  "     Î-ÍÅ2      ",   \
  "     Î-ÍÅ3      ",   \
  "     Î-ÍÅ4      ",   \
  "     Î-ÍÅ5      ",   \
  "     Î-ÍÅ6      ",   \
  "     Î-ÍÅ7      ",   \
  "     Î-ÍÅ8      ",   \
  "     Î-ÍÅ9      ",   \
  "     Î-ÍÅ10     ",   \
  "     Î-ÍÅ11     ",   \
  "     Î-ÍÅ12     ",   \
  "     Î-ÍÅ13     ",   \
  "     Î-ÍÅ14     ",   \
  "     Î-ÍÅ15     ",   \
  "     Î-ÍÅ16     ",   \
  " Îø.íàñòð.ð.ëîã."
    
#endif 
