#ifndef __CONSTANTS_OUTPUTS__
#define __CONSTANTS_OUTPUTS__

#define EKRAN_LIST_OUTPUTS_FOR_RANGUVANNJA        (EKRAN_LIST_INPUTS_FOR_RANGUVANNJA + 1)

#define EKRAN_RANGUVANNJA_OUTPUT_1                (EKRAN_RANGUVANNJA_INPUT_LAST + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_2                (EKRAN_RANGUVANNJA_OUTPUT_1 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_3                (EKRAN_RANGUVANNJA_OUTPUT_2 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_4                (EKRAN_RANGUVANNJA_OUTPUT_3 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_5                (EKRAN_RANGUVANNJA_OUTPUT_4 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_6                (EKRAN_RANGUVANNJA_OUTPUT_5 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_7                (EKRAN_RANGUVANNJA_OUTPUT_6 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_8                (EKRAN_RANGUVANNJA_OUTPUT_7 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_9                (EKRAN_RANGUVANNJA_OUTPUT_8 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_10               (EKRAN_RANGUVANNJA_OUTPUT_9 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_11               (EKRAN_RANGUVANNJA_OUTPUT_10 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_12               (EKRAN_RANGUVANNJA_OUTPUT_11 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_13               (EKRAN_RANGUVANNJA_OUTPUT_12 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_14               (EKRAN_RANGUVANNJA_OUTPUT_13 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_15               (EKRAN_RANGUVANNJA_OUTPUT_14 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_16               (EKRAN_RANGUVANNJA_OUTPUT_15 + 1)

#define EKRAN_RANGUVANNJA_OUTPUT_LAST             EKRAN_RANGUVANNJA_OUTPUT_16

#define MAX_ROW_LIST_OUTPUTS_FOR_RANGUVANNJA       NUMBER_OUTPUTS
#define MAX_ROW_RANGUVANNJA_OUTPUT                 NUMBER_TOTAL_SIGNAL_FOR_RANG

#define NAME_RANG_RU    \
  "  Блок.вкл.ВВ   ",   \
  " Сброс индикации",   \
  "   Сброс реле   ",   \
  " Местн./Дистанц.",   \
  "  Положение ВВ  ",   \
  "Откл.от вн.защит",   \
  "     Вкл.ВВ     ",   \
  " Контроль Вкл.  ",   \
  "    Откл.ВВ     ",   \
  " Контроль Откл. ",   \
  "   Привод ВВ    ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Исч.Ресурс ВВ  ",   \
  "  Неиспр.Общая  ",   \
  "  Неиспр.Авар.  ",   \
  " Работа Ан.Рег. ",   \
  " Работа Д.Рег.  ",   \
  " Откл.от защит  ",   \
  "       БО       ",   \
  "       БВ       ",   \
  " 1-я гр.уставок ",   \
  " 2-я гр.уставок ",   \
  " 3-я гр.уставок ",   \
  " 4-я гр.уставок ",   \
  " Инв.ДВ гр.уст. ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "  Изм.настроек  ",   \
  "   Блок.МТЗ1    ",   \
  "   Блок.МТЗ2    ",   \
  " Блок.уск.МТЗ2  ",   \
  "   Блок.МТЗ3    ",   \
  "   Блок.МТЗ4    ",   \
  " Сект.МТЗН1 вп. ",   \
  " Сект.МТЗН1 наз.",   \
  "    ПО МТЗ1     ",   \
  " ПО МТЗН1 вперёд",   \
  " ПО МТЗН1 назад ",   \
  "  ПО U МТЗПН1   ",   \
  "   ПО МТЗПН1    ",   \
  "      МТЗ1      ",   \
  " Сект.МТЗН2 вп. ",   \
  " Сект.МТЗН2 наз.",   \
  "    ПО МТЗ2     ",   \
  " ПО МТЗН2 вперёд",   \
  " ПО МТЗН2 назад ",   \
  "  ПО U МТЗПН2   ",   \
  "   ПО МТЗПН2    ",   \
  "      МТЗ2      ",   \
  " Сект.МТЗН3 вп. ",   \
  " Сект.МТЗН3 наз.",   \
  "    ПО МТЗ3     ",   \
  " ПО МТЗН3 вперёд",   \
  " ПО МТЗН3 назад ",   \
  "  ПО U МТЗПН3   ",   \
  "   ПО МТЗПН3    ",   \
  "      МТЗ3      ",   \
  " Сект.МТЗН4 вп. ",   \
  " Сект.МТЗН4 наз.",   \
  "    ПО МТЗ4     ",   \
  " ПО МТЗН4 вперёд",   \
  " ПО МТЗН4 назад ",   \
  "  ПО U МТЗПН4   ",   \
  "   ПО МТЗПН4    ",   \
  "      МТЗ4      ",   \
  " ПО блок.U МТЗН ",   \
  "    НЦН-МТЗ     ",   \
  "Блок.МТЗ 0.4кВ 1",   \
  "Блок.МТЗ 0.4кВ 2",   \
  "Бл.у.МТЗ 0.4кВ 2",   \
  " ПО МТЗ 0.4кВ 1 ",   \
  "  МТЗ 0.4кВ 1   ",   \
  " ПО МТЗ 0.4кВ 2 ",   \
  "  МТЗ 0.4кВ 2   ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ от ДВ ",   \
  " Свет ЗДЗ от ДВ ",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.НЗЗ    ",   \
  "     ПО НЗЗ     ",   \
  "      НЗЗ       ",   \
  "   ПО ЗЗ(3I0)   ",   \
  "    ЗЗ(3I0)     ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор НЗЗ   ",   \
  "   Блок.ТЗНП1   ",   \
  " Сект.ТЗНП1 вп. ",   \
  " Сект.ТЗНП1 наз.",   \
  "ПО 3I0 ТЗНП1 вп.",   \
  "ПО 3I0 ТЗНП1 наз",   \
  "ПО 3U0 ТЗНП1 вп.",   \
  "ПО 3U0 ТЗНП1 наз",   \
  "  ПО ТЗНП1 вп.  ",   \
  " ПО ТЗНП1 наз.  ",   \
  "     ТЗНП1      ",   \
  "   Блок.ТЗНП2   ",   \
  " Сект.ТЗНП2 вп. ",   \
  " Сект.ТЗНП2 наз.",   \
  "ПО 3I0 ТЗНП2 вп.",   \
  "ПО 3I0 ТЗНП2 наз",   \
  "ПО 3U0 ТЗНП2 вп.",   \
  "ПО 3U0 ТЗНП2 наз",   \
  "  ПО ТЗНП2 вп.  ",   \
  " ПО ТЗНП2 наз.  ",   \
  "     ТЗНП2      ",   \
  "   Блок.ТЗНП3   ",   \
  " Сект.ТЗНП3 вп. ",   \
  " Сект.ТЗНП3 наз.",   \
  "ПО 3I0 ТЗНП3 вп.",   \
  "ПО 3I0 ТЗНП3 наз",   \
  "ПО 3U0 ТЗНП3 вп.",   \
  "ПО 3U0 ТЗНП3 наз",   \
  "  ПО ТЗНП3 вп.  ",   \
  " ПО ТЗНП3 наз.  ",   \
  "     ТЗНП3      ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "      АПВ2      ",   \
  "      АПВ3      ",   \
  "      АПВ4      ",   \
  "   Работа АПВ   ",   \
  " АЧР/ЧАПВ от ДВ ",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "   Разр.ЧАПВ    ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР1     ",   \
  "    ПО ЧАПВ1    ",   \
  "   АЧР/ЧАПВ1    ",   \
  "    ПО АЧР2     ",   \
  "    ПО ЧАПВ2    ",   \
  "   АЧР/ЧАПВ2    ",   \
  " Пуск УРОВ от ДВ",   \
  "    ПО УРОВ     ",   \
  "     УРОВ1      ",   \
  "     УРОВ2      ",   \
  " Блок.ЗОП(КОФ)  ",   \
  "  ПО ЗОП(КОФ)   ",   \
  "    ЗОП(КОФ)    ",   \
  "  Блок.ЗНмин1   ",   \
  "  Пуск ЗНмин1   ",   \
  "  Блок.ЗНмин2   ",   \
  "  Пуск ЗНмин2   ",   \
  "   ПО ЗНмин1    ",   \
  " ПО Uблк.ЗНмин1 ",   \
  " ПО Iблк.ЗНмин1 ",   \
  "     ЗНмин1     ",   \
  "     ПО ЗНмин2  ",   \
  " ПО Uблк.ЗНмин2 ",   \
  " ПО Iблк.ЗНмин2 ",   \
  "     ЗНмин2     ",   \
  "  Блок.ЗНмакс1  ",   \
  "   ПО ЗНмакс1   ",   \
  "    ЗНмакс1     ",   \
  "  Блок.ЗНмакс2  ",   \
  "   ПО ЗНмакс2   ",   \
  "    ЗНмакс2     ",   \
  "    Блок.УЗx    ",   \
  "     ПО УЗx     ",   \
  "      УЗx       ",   \
  " Вх.О-функции1  ",   \
  " Вых.О-функции1 ",   \
  " Вх.О-функции2  ",   \
  " Вых.О-функции2 ",   \
  " Вх.О-функции3  ",   \
  " Вых.О-функции3 ",   \
  " Вх.О-функции4  ",   \
  " Вых.О-функции4 ",   \
  " Вх.О-функции5  ",   \
  " Вых.О-функции5 ",   \
  " Вх.О-функции6  ",   \
  " Вых.О-функции6 ",   \
  " Вх.О-функции7  ",   \
  " Вых.О-функции7 ",   \
  " Вх.О-функции8  ",   \
  " Вых.О-функции8 ",   \
  " Уст.О-триггера1",   \
  " Сбр.О-триггера1",   \
  " Вых.О-триггера1",   \
  " Уст.О-триггера2",   \
  " Сбр.О-триггера2",   \
  " Вых.О-триггера2",   \
  " Уст.О-триггера3",   \
  " Сбр.О-триггера3",   \
  " Вых.О-триггера3",   \
  " Уст.О-триггера4",   \
  " Сбр.О-триггера4",   \
  " Вых.О-триггера4",   \
  "      О-И1      ",   \
  "      О-И2      ",   \
  "      О-И3      ",   \
  "      О-И4      ",   \
  "      О-И5      ",   \
  "      О-И6      ",   \
  "      О-И7      ",   \
  "      О-И8      ",   \
  "     О-ИЛИ1     ",   \
  "     О-ИЛИ2     ",   \
  "     О-ИЛИ3     ",   \
  "     О-ИЛИ4     ",   \
  "     О-ИЛИ5     ",   \
  "     О-ИЛИ6     ",   \
  "     О-ИЛИ7     ",   \
  "     О-ИЛИ8     ",   \
  "  О-Искл.ИЛИ1   ",   \
  "  О-Искл.ИЛИ2   ",   \
  "  О-Искл.ИЛИ3   ",   \
  "  О-Искл.ИЛИ4   ",   \
  "  О-Искл.ИЛИ5   ",   \
  "  О-Искл.ИЛИ6   ",   \
  "  О-Искл.ИЛИ7   ",   \
  "  О-Искл.ИЛИ8   ",   \
  "     О-НЕ1      ",   \
  "     О-НЕ2      ",   \
  "     О-НЕ3      ",   \
  "     О-НЕ4      ",   \
  "     О-НЕ5      ",   \
  "     О-НЕ6      ",   \
  "     О-НЕ7      ",   \
  "     О-НЕ8      ",   \
  "     О-НЕ9      ",   \
  "     О-НЕ10     ",   \
  "     О-НЕ11     ",   \
  "     О-НЕ12     ",   \
  "     О-НЕ13     ",   \
  "     О-НЕ14     ",   \
  "     О-НЕ15     ",   \
  "     О-НЕ16     ",   \
  " Ош.настр.р.лог."

#define NAME_RANG_UA    \
  " Блок.ввімкн.ВВ ",   \
  " Скид.індикації ",   \
  "   Скид.реле    ",   \
  " Місц./Дистанц. ",   \
  "    Стан ВВ     ",   \
  "Вимк.від зовн.з.",   \
  "    Ввімк.ВВ    ",   \
  " Контроль Ввімк.",   \
  "    Вимк.ВВ     ",   \
  " Контроль Вимк. ",   \
  "   Привід ВВ    ",   \
  " Перев.Iв.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Вич.Ресурс ВВ  ",   \
  " Неспр.Загальна ",   \
  "  Неспр.Авар.   ",   \
  " Роб.Ан.Реєстр. ",   \
  " Роб.Д.Реєстр.  ",   \
  " Вимк.від зах.  ",   \
  "     БВимк.     ",   \
  "    БВвімк.     ",   \
  " 1-а гр.уставок ",   \
  " 2-а гр.уставок ",   \
  " 3-а гр.уставок ",   \
  " 4-а гр.уставок ",   \
  " Інв.ДВ гр.уст. ",   \
  "Бл.гр.уст.від з.",   \
  " С.блк.Гот.до ТУ",   \
  "Готовність до ТУ",   \
  " Зм.налаштування",   \
  "   Блок.МСЗ1    ",   \
  "   Блок.МСЗ2    ",   \
  " Блок.приск.МСЗ2",   \
  "   Блок.МСЗ3    ",   \
  "   Блок.МСЗ4    ",   \
  " Сект.МСЗН1 вп. ",   \
  " Сект.МСЗН1 наз.",   \
  "    ПО МСЗ1     ",   \
  " ПО МСЗН1 вперед",   \
  " ПО МСЗН1 назад ",   \
  "  ПО U МСЗПН1   ",   \
  "   ПО МСЗПН1    ",   \
  "      МСЗ1      ",   \
  " Сект.МСЗН2 вп. ",   \
  " Сект.МСЗН2 наз.",   \
  "    ПО МСЗ2     ",   \
  " ПО МСЗН2 вперед",   \
  " ПО МСЗН2 назад ",   \
  "  ПО U МСЗПН2   ",   \
  "   ПО МСЗПН2    ",   \
  "      МСЗ2      ",   \
  " Сект.МСЗН3 вп. ",   \
  " Сект.МСЗН3 наз.",   \
  "    ПО МСЗ3     ",   \
  " ПО МСЗН3 вперед",   \
  " ПО МСЗН3 назад ",   \
  "  ПО U МСЗПН3   ",   \
  "   ПО МСЗПН3    ",   \
  "      МСЗ3      ",   \
  " Сект.МСЗН4 вп. ",   \
  " Сект.МСЗН4 наз.",   \
  "    ПО МСЗ4     ",   \
  " ПО МСЗН4 вперед",   \
  " ПО МСЗН4 назад ",   \
  "  ПО U МСЗПН4   ",   \
  "   ПО МСЗПН4    ",   \
  "      МСЗ4      ",   \
  " ПО блок.U МСЗН ",   \
  "    НКН-МСЗ     ",   \
  "Блок.МСЗ 0.4кВ 1",   \
  "Блок.МСЗ 0.4кВ 2",   \
  "Бл.п.МСЗ 0.4кВ 2",   \
  " ПО МСЗ 0.4кВ 1 ",   \
  "  МСЗ 0.4кВ 1   ",   \
  " ПО МСЗ 0.4кВ 2 ",   \
  "  МСЗ 0.4кВ 2   ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ від ДВ",   \
  " Св.ЗДЗ від ДВ  ",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.НЗЗ    ",   \
  "     ПО НЗЗ     ",   \
  "      НЗЗ       ",   \
  "   ПО ЗЗ(3I0)   ",   \
  "    ЗЗ(3I0)     ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор НЗЗ   ",   \
  "   Блок.СЗНП1   ",   \
  " Сект.СЗНП1 вп. ",   \
  " Сект.СЗНП1 наз.",   \
  "ПО 3I0 СЗНП1 вп.",   \
  "ПО 3I0 СЗНП1 наз",   \
  "ПО 3U0 СЗНП1 вп.",   \
  "ПО 3U0 СЗНП1 наз",   \
  "  ПО СЗНП1 вп.  ",   \
  " ПО СЗНП1 наз.  ",   \
  "     СЗНП1      ",   \
  "   Блок.СЗНП2   ",   \
  " Сект.СЗНП2 вп. ",   \
  " Сект.СЗНП2 наз.",   \
  "ПО 3I0 СЗНП2 вп.",   \
  "ПО 3I0 СЗНП2 наз",   \
  "ПО 3U0 СЗНП2 вп.",   \
  "ПО 3U0 СЗНП2 наз",   \
  "  ПО СЗНП2 вп.  ",   \
  " ПО СЗНП2 наз.  ",   \
  "     СЗНП2      ",   \
  "   Блок.СЗНП3   ",   \
  " Сект.СЗНП3 вп. ",   \
  " Сект.СЗНП3 наз.",   \
  "ПО 3I0 СЗНП3 вп.",   \
  "ПО 3I0 СЗНП3 наз",   \
  "ПО 3U0 СЗНП3 вп.",   \
  "ПО 3U0 СЗНП3 наз",   \
  "  ПО СЗНП3 вп.  ",   \
  " ПО СЗНП3 наз.  ",   \
  "     СЗНП3      ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "      АПВ2      ",   \
  "      АПВ3      ",   \
  "      АПВ4      ",   \
  "   Робота АПВ   ",   \
  " АЧР/ЧАПВ від ДВ",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "  Дозвіл ЧАПВ   ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР1     ",   \
  "    ПО ЧАПВ1    ",   \
  "   АЧР/ЧАПВ1    ",   \
  "    ПО АЧР2     ",   \
  "    ПО ЧАПВ2    ",   \
  "   АЧР/ЧАПВ2    ",   \
  "Пуск ПРВВ від ДВ",   \
  "    ПО ПРВВ     ",   \
  "     ПРВВ1      ",   \
  "     ПРВВ2      ",   \
  " Блок.ЗЗП(КОФ)  ",   \
  "  ПО ЗЗП(КОФ)   ",   \
  "    ЗЗП(КОФ)    ",   \
  "  Блок.ЗНмін1   ",   \
  "  Пуск ЗНмін1   ",   \
  "  Блок.ЗНмін2   ",   \
  "  Пуск ЗНмін2   ",   \
  "   ПО ЗНмін1    ",   \
  " ПО Uблк.ЗНмін1 ",   \
  " ПО Iблк.ЗНмін1 ",   \
  "     ЗНмін1     ",   \
  "     ПО ЗНмін2  ",   \
  " ПО Uблк.ЗНмін2 ",   \
  " ПО Iблк.ЗНмін2 ",   \
  "     ЗНмін2     ",   \
  "  Блок.ЗНмакс1  ",   \
  "   ПО ЗНмакс1   ",   \
  "    ЗНмакс1     ",   \
  "  Блок.ЗНмакс2  ",   \
  "   ПО ЗНмакс2   ",   \
  "    ЗНмакс2     ",   \
  "    Блок.УЗx    ",   \
  "     ПО УЗx     ",   \
  "      УЗx       ",   \
  " Вх.В-функції1  ",   \
  " Вих.В-функції1 ",   \
  " Вх.В-функції2  ",   \
  " Вих.В-функції2 ",   \
  " Вх.В-функції3  ",   \
  " Вих.В-функції3 ",   \
  " Вх.В-функції4  ",   \
  " Вих.В-функції4 ",   \
  " Вх.В-функції5  ",   \
  " Вих.В-функції5 ",   \
  " Вх.В-функції6  ",   \
  " Вих.В-функції6 ",   \
  " Вх.В-функції7  ",   \
  " Вих.В-функції7 ",   \
  " Вх.В-функції8  ",   \
  " Вих.В-функції8 ",   \
  " Вст.В-триґера1 ",   \
  " Ск.В-триґера1  ",   \
  " Вих.В-триґера1 ",   \
  " Вст.В-триґера2 ",   \
  " Ск.В-триґера2  ",   \
  " Вих.В-триґера2 ",   \
  " Вст.В-триґера3 ",   \
  " Ск.В-триґера3  ",   \
  " Вих.В-триґера3 ",   \
  " Вст.В-триґера4 ",   \
  " Ск.В-триґера4  ",   \
  " Вих.В-триґера4 ",   \
  "      В-І1      ",   \
  "      В-І2      ",   \
  "      В-І3      ",   \
  "      В-І4      ",   \
  "      В-І5      ",   \
  "      В-І6      ",   \
  "      В-І7      ",   \
  "      В-І8      ",   \
  "     В-АБО1     ",   \
  "     В-АБО2     ",   \
  "     В-АБО3     ",   \
  "     В-АБО4     ",   \
  "     В-АБО5     ",   \
  "     В-АБО6     ",   \
  "     В-АБО7     ",   \
  "     В-АБО8     ",   \
  "  В-Викл.АБО1   ",   \
  "  В-Викл.АБО2   ",   \
  "  В-Викл.АБО3   ",   \
  "  В-Викл.АБО4   ",   \
  "  В-Викл.АБО5   ",   \
  "  В-Викл.АБО6   ",   \
  "  В-Викл.АБО7   ",   \
  "  В-Викл.АБО8   ",   \
  "     В-НЕ1      ",   \
  "     В-НЕ2      ",   \
  "     В-НЕ3      ",   \
  "     В-НЕ4      ",   \
  "     В-НЕ5      ",   \
  "     В-НЕ6      ",   \
  "     В-НЕ7      ",   \
  "     В-НЕ8      ",   \
  "     В-НЕ9      ",   \
  "     В-НЕ10     ",   \
  "     В-НЕ11     ",   \
  "     В-НЕ12     ",   \
  "     В-НЕ13     ",   \
  "     В-НЕ14     ",   \
  "     В-НЕ15     ",   \
  "     В-НЕ16     ",   \
  " Пом.нал.р.лог. "
    
#define NAME_RANG_EN    \
  " ON CB Blocking ",   \
  "Indication Reset",   \
  "  Relay Reset   ",   \
  "  Local/Remote  ",   \
  "  State of CB   ",   \
  "Откл.от вн.защит",   \
  "     On CB      ",   \
  " On CB Control  ",   \
  "     Off CB     ",   \
  " Off CB Control ",   \
  "  CB Actuator   ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Исч.Ресурс ВВ  ",   \
  "  Total Fault   ",   \
  " Emergence Fault",   \
  "An.Rec.Operation",   \
  " D.Rec.Operation",   \
  " Откл.от защит  ",   \
  "Off CB Operation",   \
  " On CB Operation",   \
  " Pick-up Set 1  ",   \
  " Pick-up Set 2  ",   \
  " Pick-up Set 3  ",   \
  " Pick-up Set 4  ",   \
  " Инв.ДВ гр.уст. ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "Changed settings",   \
  "  Blc.of OCP1   ",   \
  "  Blc.of OCP2   ",   \
  "  OCP2 Acc.Blc. ",   \
  "  Blc.of OCP3   ",   \
  "  Blc.of OCP4   ",   \
  " Сект.МТЗН1 вп. ",   \
  " Сект.МТЗН1 наз.",   \
  "    OCP1 SE     ",   \
  " ПО МТЗН1 вперёд",   \
  " ПО МТЗН1 назад ",   \
  "  ПО U МТЗПН1   ",   \
  "   ПО МТЗПН1    ",   \
  "      OCP1      ",   \
  " Сект.МТЗН2 вп. ",   \
  " Сект.МТЗН2 наз.",   \
  "    OCP2 SE     ",   \
  " ПО МТЗН2 вперёд",   \
  " ПО МТЗН2 назад ",   \
  "  ПО U МТЗПН2   ",   \
  "   ПО МТЗПН2    ",   \
  "      OCP2      ",   \
  " Сект.МТЗН3 вп. ",   \
  " Сект.МТЗН3 наз.",   \
  "    OCP3 SE     ",   \
  " ПО МТЗН3 вперёд",   \
  " ПО МТЗН3 назад ",   \
  "  ПО U МТЗПН3   ",   \
  "   ПО МТЗПН3    ",   \
  "      OCP3      ",   \
  " Сект.МТЗН4 вп. ",   \
  " Сект.МТЗН4 наз.",   \
  "    OCP4 SE     ",   \
  " ПО МТЗН4 вперёд",   \
  " ПО МТЗН4 назад ",   \
  "  ПО U МТЗПН4   ",   \
  "   ПО МТЗПН4    ",   \
  "      OCP4      ",   \
  " ПО блок.U МТЗН ",   \
  "    НЦН-МТЗ     ",   \
  "OCP 0.4kV 1 Blc.",   \
  "OCP 0.4kV 2 Blc.",   \
  "OCP 0.4kV 2 Ac.B",   \
  " OCP 0.4kV 1 SE ",   \
  "  OCP 0.4kV 1   ",   \
  " OCP 0.4kV 2 SE ",   \
  "  OCP 0.4kV 2   ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ от ДВ ",   \
  " Свет ЗДЗ от ДВ ",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.НЗЗ    ",   \
  "     ПО НЗЗ     ",   \
  "      НЗЗ       ",   \
  "  SGFP(3Io) SE  ",   \
  "   SGFP(3Io)    ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор НЗЗ   ",   \
  "   Блок.ТЗНП1   ",   \
  " Сект.ТЗНП1 вп. ",   \
  " Сект.ТЗНП1 наз.",   \
  "ПО 3I0 ТЗНП1 вп.",   \
  "ПО 3I0 ТЗНП1 наз",   \
  "ПО 3U0 ТЗНП1 вп.",   \
  "ПО 3U0 ТЗНП1 наз",   \
  "  ПО ТЗНП1 вп.  ",   \
  " ПО ТЗНП1 наз.  ",   \
  "     ТЗНП1      ",   \
  "   Блок.ТЗНП2   ",   \
  " Сект.ТЗНП2 вп. ",   \
  " Сект.ТЗНП2 наз.",   \
  "ПО 3I0 ТЗНП2 вп.",   \
  "ПО 3I0 ТЗНП2 наз",   \
  "ПО 3U0 ТЗНП2 вп.",   \
  "ПО 3U0 ТЗНП2 наз",   \
  "  ПО ТЗНП2 вп.  ",   \
  " ПО ТЗНП2 наз.  ",   \
  "     ТЗНП2      ",   \
  "   Блок.ТЗНП3   ",   \
  " Сект.ТЗНП3 вп. ",   \
  " Сект.ТЗНП3 наз.",   \
  "ПО 3I0 ТЗНП3 вп.",   \
  "ПО 3I0 ТЗНП3 наз",   \
  "ПО 3U0 ТЗНП3 вп.",   \
  "ПО 3U0 ТЗНП3 наз",   \
  "  ПО ТЗНП3 вп.  ",   \
  " ПО ТЗНП3 наз.  ",   \
  "     ТЗНП3      ",   \
  "Static Blc.of AR",   \
  "       AR       ",   \
  "      AR2       ",   \
  "      AR3       ",   \
  "      AR4       ",   \
  "   Работа АПВ   ",   \
  "UFLS/FAR from DI",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "   Разр.ЧАПВ    ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР1     ",   \
  "   ПО ЧАПВ1     ",   \
  "   UFLS/FAR1    ",   \
  "    ПО АЧР2     ",   \
  "   ПО ЧАПВ2     ",   \
  "   UFLS/FAR2    ",   \
  " CBFP Start f.DI",   \
  "    CBFP SE     ",   \
  "     CBFP1      ",   \
  "     CBFP2      ",   \
  "  Blc.of NPSP   ",   \
  "    NPSP SE     ",   \
  "      NPSP      ",   \
  "   Блок.Umin1   ",   \
  "   Пуск Umin1   ",   \
  "   Блок.Umin2   ",   \
  "   Пуск Umin2   ",   \
  "    ПО Umin1    ",   \
  " ПО Uблк.Umin1  ",   \
  " ПО Iблк.Umin1  ",   \
  "     Umin1      ",   \
  "    ПО Umin2    ",   \
  " ПО Uблк.Umin2  ",   \
  " ПО Iблк.Umin2  ",   \
  "     Umin2      ",   \
  "   Блок.Umax1   ",   \
  "    ПО Umax1    ",   \
  "     Umax1      ",   \
  "   Блок.Umax2   ",   \
  "    ПО Umax2    ",   \
  "     Umax2      ",   \
  "   Blc.of UPx   ",   \
  "     UPx SE     ",   \
  "      UPx       ",   \
  "    UDF1 In     ",   \
  "    UDF1 Out    ",   \
  "    UDF2 In     ",   \
  "    UDF2 Out    ",   \
  "    UDF3 In     ",   \
  "    UDF3 Out    ",   \
  "    UDF4 In     ",   \
  "    UDF4 Out    ",   \
  "    UDF5 In     ",   \
  "    UDF5 Out    ",   \
  "    UDF6 In     ",   \
  "    UDF6 Out    ",   \
  "    UDF7 In     ",   \
  "    UDF7 Out    ",   \
  "    UDF8 In     ",   \
  "    UDF8 Out    ",   \
  "UD Flip-Flop1 S.",   \
  "UD Flip-Flop1 R.",   \
  "UD Flip-Flop1 O.",   \
  "UD Flip-Flop2 S.",   \
  "UD Flip-Flop2 R.",   \
  "UD Flip-Flop2 O.",   \
  "UD Flip-Flop3 S.",   \
  "UD Flip-Flop3 R.",   \
  "UD Flip-Flop3 O.",   \
  "UD Flip-Flop4 S.",   \
  "UD Flip-Flop4 R.",   \
  "UD Flip-Flop4 O.",   \
  "    UD AND1     ",   \
  "    UD AND2     ",   \
  "    UD AND3     ",   \
  "    UD AND4     ",   \
  "    UD AND5     ",   \
  "    UD AND6     ",   \
  "    UD AND7     ",   \
  "    UD AND8     ",   \
  "     UD OR1     ",   \
  "     UD OR2     ",   \
  "     UD OR3     ",   \
  "     UD OR4     ",   \
  "     UD OR5     ",   \
  "     UD OR6     ",   \
  "     UD OR7     ",   \
  "     UD OR8     ",   \
  "    UD XOR1     ",   \
  "    UD XOR2     ",   \
  "    UD XOR3     ",   \
  "    UD XOR4     ",   \
  "    UD XOR5     ",   \
  "    UD XOR6     ",   \
  "    UD XOR7     ",   \
  "    UD XOR8     ",   \
  "    UD NOT1     ",   \
  "    UD NOT2     ",   \
  "    UD NOT3     ",   \
  "    UD NOT4     ",   \
  "    UD NOT5     ",   \
  "    UD NOT6     ",   \
  "    UD NOT7     ",   \
  "    UD NOT8     ",   \
  "    UD NOT9     ",   \
  "    UD NOT10    ",   \
  "    UD NOT11    ",   \
  "    UD NOT12    ",   \
  "    UD NOT13    ",   \
  "    UD NOT14    ",   \
  "    UD NOT15    ",   \
  "    UD NOT16    ",   \
  " Ош.настр.р.лог."

#define NAME_RANG_KZ    \
  "  Блок.вкл.ВВ   ",   \
  " Сброс индикации",   \
  "   Сброс реле   ",   \
  " Местн./Дистанц.",   \
  "  Положение ВВ  ",   \
  "Откл.от вн.защит",   \
  "     Вкл.ВВ     ",   \
  " Контроль Вкл.  ",   \
  "    Откл.ВВ     ",   \
  " Контроль Откл. ",   \
  "   Привод ВВ    ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Исч.Ресурс ВВ  ",   \
  "  Неиспр.Общая  ",   \
  "  Неиспр.Авар.  ",   \
  " Работа Ан.Рег. ",   \
  " Работа Д.Рег.  ",   \
  " Откл.от защит  ",   \
  "       БО       ",   \
  "       БВ       ",   \
  " 1-я гр.уставок ",   \
  " 2-я гр.уставок ",   \
  " 3-я гр.уставок ",   \
  " 4-я гр.уставок ",   \
  " Инв.ДВ гр.уст. ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "  Изм.настроек  ",   \
  "   Блок.МТЗ1    ",   \
  "   Блок.МТЗ2    ",   \
  " Блок.уск.МТЗ2  ",   \
  "   Блок.МТЗ3    ",   \
  "   Блок.МТЗ4    ",   \
  " Сект.МТЗН1 вп. ",   \
  " Сект.МТЗН1 наз.",   \
  "    ПО МТЗ1     ",   \
  " ПО МТЗН1 вперёд",   \
  " ПО МТЗН1 назад ",   \
  "  ПО U МТЗПН1   ",   \
  "   ПО МТЗПН1    ",   \
  "      МТЗ1      ",   \
  " Сект.МТЗН2 вп. ",   \
  " Сект.МТЗН2 наз.",   \
  "    ПО МТЗ2     ",   \
  " ПО МТЗН2 вперёд",   \
  " ПО МТЗН2 назад ",   \
  "  ПО U МТЗПН2   ",   \
  "   ПО МТЗПН2    ",   \
  "      МТЗ2      ",   \
  " Сект.МТЗН3 вп. ",   \
  " Сект.МТЗН3 наз.",   \
  "    ПО МТЗ3     ",   \
  " ПО МТЗН3 вперёд",   \
  " ПО МТЗН3 назад ",   \
  "  ПО U МТЗПН3   ",   \
  "   ПО МТЗПН3    ",   \
  "      МТЗ3      ",   \
  " Сект.МТЗН4 вп. ",   \
  " Сект.МТЗН4 наз.",   \
  "    ПО МТЗ4     ",   \
  " ПО МТЗН4 вперёд",   \
  " ПО МТЗН4 назад ",   \
  "  ПО U МТЗПН4   ",   \
  "   ПО МТЗПН4    ",   \
  "      МТЗ4      ",   \
  " ПО блок.U МТЗН ",   \
  "    НЦН-МТЗ     ",   \
  "Блок.МТЗ 0.4кВ 1",   \
  "Блок.МТЗ 0.4кВ 2",   \
  "Бл.у.МТЗ 0.4кВ 2",   \
  " ПО МТЗ 0.4кВ 1 ",   \
  "  МТЗ 0.4кВ 1   ",   \
  " ПО МТЗ 0.4кВ 2 ",   \
  "  МТЗ 0.4кВ 2   ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ от ДВ ",   \
  " Свет ЗДЗ от ДВ ",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.НЗЗ    ",   \
  "     ПО НЗЗ     ",   \
  "      НЗЗ       ",   \
  "   ПО ЗЗ(3I0)   ",   \
  "    ЗЗ(3I0)     ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор НЗЗ   ",   \
  "   Блок.ТЗНП1   ",   \
  " Сект.ТЗНП1 вп. ",   \
  " Сект.ТЗНП1 наз.",   \
  "ПО 3I0 ТЗНП1 вп.",   \
  "ПО 3I0 ТЗНП1 наз",   \
  "ПО 3U0 ТЗНП1 вп.",   \
  "ПО 3U0 ТЗНП1 наз",   \
  "  ПО ТЗНП1 вп.  ",   \
  " ПО ТЗНП1 наз.  ",   \
  "     ТЗНП1      ",   \
  "   Блок.ТЗНП2   ",   \
  " Сект.ТЗНП2 вп. ",   \
  " Сект.ТЗНП2 наз.",   \
  "ПО 3I0 ТЗНП2 вп.",   \
  "ПО 3I0 ТЗНП2 наз",   \
  "ПО 3U0 ТЗНП2 вп.",   \
  "ПО 3U0 ТЗНП2 наз",   \
  "  ПО ТЗНП2 вп.  ",   \
  " ПО ТЗНП2 наз.  ",   \
  "     ТЗНП2      ",   \
  "   Блок.ТЗНП3   ",   \
  " Сект.ТЗНП3 вп. ",   \
  " Сект.ТЗНП3 наз.",   \
  "ПО 3I0 ТЗНП3 вп.",   \
  "ПО 3I0 ТЗНП3 наз",   \
  "ПО 3U0 ТЗНП3 вп.",   \
  "ПО 3U0 ТЗНП3 наз",   \
  "  ПО ТЗНП3 вп.  ",   \
  " ПО ТЗНП3 наз.  ",   \
  "     ТЗНП3      ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "      АПВ2      ",   \
  "      АПВ3      ",   \
  "      АПВ4      ",   \
  "   Работа АПВ   ",   \
  " АЧР/ЧАПВ от ДВ ",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "   Разр.ЧАПВ    ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР1     ",   \
  "    ПО ЧАПВ1    ",   \
  "   АЧР/ЧАПВ1    ",   \
  "    ПО АЧР2     ",   \
  "    ПО ЧАПВ2    ",   \
  "   АЧР/ЧАПВ2    ",   \
  " Пуск УРОВ от ДВ",   \
  "    ПО УРОВ     ",   \
  "     УРОВ1      ",   \
  "     УРОВ2      ",   \
  " Блок.ЗОП(КОФ)  ",   \
  "  ПО ЗОП(КОФ)   ",   \
  "    ЗОП(КОФ)    ",   \
  "  Блок.ЗНмин1   ",   \
  "  Пуск ЗНмин1   ",   \
  "  Блок.ЗНмин2   ",   \
  "  Пуск ЗНмин2   ",   \
  "   ПО ЗНмин1    ",   \
  " ПО Uблк.ЗНмин1 ",   \
  " ПО Iблк.ЗНмин1 ",   \
  "     ЗНмин1     ",   \
  "     ПО ЗНмин2  ",   \
  " ПО Uблк.ЗНмин2 ",   \
  " ПО Iблк.ЗНмин2 ",   \
  "     ЗНмин2     ",   \
  "  Блок.ЗНмакс1  ",   \
  "   ПО ЗНмакс1   ",   \
  "    ЗНмакс1     ",   \
  "  Блок.ЗНмакс2  ",   \
  "   ПО ЗНмакс2   ",   \
  "    ЗНмакс2     ",   \
  "    Блок.УЗx    ",   \
  "     ПО УЗx     ",   \
  "      УЗx       ",   \
  " Вх.О-функции1  ",   \
  " Вых.О-функции1 ",   \
  " Вх.О-функции2  ",   \
  " Вых.О-функции2 ",   \
  " Вх.О-функции3  ",   \
  " Вых.О-функции3 ",   \
  " Вх.О-функции4  ",   \
  " Вых.О-функции4 ",   \
  " Вх.О-функции5  ",   \
  " Вых.О-функции5 ",   \
  " Вх.О-функции6  ",   \
  " Вых.О-функции6 ",   \
  " Вх.О-функции7  ",   \
  " Вых.О-функции7 ",   \
  " Вх.О-функции8  ",   \
  " Вых.О-функции8 ",   \
  " Уст.О-триггера1",   \
  " Сбр.О-триггера1",   \
  " Вых.О-триггера1",   \
  " Уст.О-триггера2",   \
  " Сбр.О-триггера2",   \
  " Вых.О-триггера2",   \
  " Уст.О-триггера3",   \
  " Сбр.О-триггера3",   \
  " Вых.О-триггера3",   \
  " Уст.О-триггера4",   \
  " Сбр.О-триггера4",   \
  " Вых.О-триггера4",   \
  "      О-И1      ",   \
  "      О-И2      ",   \
  "      О-И3      ",   \
  "      О-И4      ",   \
  "      О-И5      ",   \
  "      О-И6      ",   \
  "      О-И7      ",   \
  "      О-И8      ",   \
  "     О-ИЛИ1     ",   \
  "     О-ИЛИ2     ",   \
  "     О-ИЛИ3     ",   \
  "     О-ИЛИ4     ",   \
  "     О-ИЛИ5     ",   \
  "     О-ИЛИ6     ",   \
  "     О-ИЛИ7     ",   \
  "     О-ИЛИ8     ",   \
  "  О-Искл.ИЛИ1   ",   \
  "  О-Искл.ИЛИ2   ",   \
  "  О-Искл.ИЛИ3   ",   \
  "  О-Искл.ИЛИ4   ",   \
  "  О-Искл.ИЛИ5   ",   \
  "  О-Искл.ИЛИ6   ",   \
  "  О-Искл.ИЛИ7   ",   \
  "  О-Искл.ИЛИ8   ",   \
  "     О-НЕ1      ",   \
  "     О-НЕ2      ",   \
  "     О-НЕ3      ",   \
  "     О-НЕ4      ",   \
  "     О-НЕ5      ",   \
  "     О-НЕ6      ",   \
  "     О-НЕ7      ",   \
  "     О-НЕ8      ",   \
  "     О-НЕ9      ",   \
  "     О-НЕ10     ",   \
  "     О-НЕ11     ",   \
  "     О-НЕ12     ",   \
  "     О-НЕ13     ",   \
  "     О-НЕ14     ",   \
  "     О-НЕ15     ",   \
  "     О-НЕ16     ",   \
  " Ош.настр.р.лог."
    
#endif 
