#ifndef __CONSTANTS_OUTPUTS__
#define __CONSTANTS_OUTPUTS__

#define EKRAN_LIST_OUTPUTS_FOR_RANGUVANNJA        (EKRAN_LIST_INPUTS_FOR_RANGUVANNJA + 1)

#define EKRAN_RANGUVANNJA_OUTPUT_1                (EKRAN_RANGUVANNJA_INPUT_LAST + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_2                (EKRAN_RANGUVANNJA_OUTPUT_1 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_3                (EKRAN_RANGUVANNJA_OUTPUT_2 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_4                (EKRAN_RANGUVANNJA_OUTPUT_3 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_5                (EKRAN_RANGUVANNJA_OUTPUT_4 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_6                (EKRAN_RANGUVANNJA_OUTPUT_5 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_7                (EKRAN_RANGUVANNJA_OUTPUT_6 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_8                (EKRAN_RANGUVANNJA_OUTPUT_7 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_9                (EKRAN_RANGUVANNJA_OUTPUT_8 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_10               (EKRAN_RANGUVANNJA_OUTPUT_9 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_11               (EKRAN_RANGUVANNJA_OUTPUT_10 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_12               (EKRAN_RANGUVANNJA_OUTPUT_11 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_13               (EKRAN_RANGUVANNJA_OUTPUT_12 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_14               (EKRAN_RANGUVANNJA_OUTPUT_13 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_15               (EKRAN_RANGUVANNJA_OUTPUT_14 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_16               (EKRAN_RANGUVANNJA_OUTPUT_15 + 1)

#define EKRAN_RANGUVANNJA_OUTPUT_LAST             EKRAN_RANGUVANNJA_OUTPUT_16

#define MAX_ROW_LIST_OUTPUTS_FOR_RANGUVANNJA       NUMBER_SIMPLE_OUTPUTS
#define MAX_ROW_RANGUVANNJA_OUTPUT                 NUMBER_TOTAL_SIGNAL_FOR_RANG

#define NAME_RANG_RU    \
  "  Блок.вкл.ВВ   ",   \
  " Сброс индикации",   \
  "   Сброс реле   ",   \
  " Местн./Дистанц.",   \
  "  Положение ВВ  ",   \
  "Откл.от вн.защит",   \
  "     Вкл.ВВ     ",   \
  " Контроль Вкл.  ",   \
  "    Откл.ВВ     ",   \
  " Контроль Откл. ",   \
  "   Привод ВВ    ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Исч.Ресурс ВВ  ",   \
  "  Неиспр.Общая  ",   \
  "  Неиспр.Авар.  ",   \
  " Работа Ан.Рег. ",   \
  " Работа Д.Рег.  ",   \
  " Откл.от защит  ",   \
  "       БО       ",   \
  "       БВ       ",   \
  " 1-я гр.уставок ",   \
  " 2-я гр.уставок ",   \
  " 3-я гр.уставок ",   \
  " 4-я гр.уставок ",   \
  " Инв.ДВ гр.уст. ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "  Изм.настроек  ",   \
  " Блок.Вх.GOOSExx",   \
  "  Блок.Вх.MMSx  ",   \
  "   Блок.ВСБx    ",   \
  "   Блок.МТЗ1    ",   \
  "   Блок.МТЗ2    ",   \
  " Блок.уск.МТЗ2  ",   \
  "   Блок.МТЗ3    ",   \
  "   Блок.МТЗ4    ",   \
  " Сект.МТЗН1 Пр. ",   \
  " Сект.МТЗН1 Обр.",   \
  "    ПО МТЗ1     ",   \
  " ПО МТЗН1 Прямой",   \
  " ПО МТЗН1 Обр.  ",   \
  "  ПО U МТЗПН1   ",   \
  "   ПО МТЗПН1    ",   \
  "      МТЗ1      ",   \
  " Сект.МТЗН2 Пр. ",   \
  " Сект.МТЗН2 Обр.",   \
  "    ПО МТЗ2     ",   \
  " ПО МТЗН2 Прямой",   \
  " ПО МТЗН2 Обр.  ",   \
  "  ПО U МТЗПН2   ",   \
  "   ПО МТЗПН2    ",   \
  "      МТЗ2      ",   \
  " Сект.МТЗН3 Пр. ",   \
  " Сект.МТЗН3 Обр.",   \
  "    ПО МТЗ3     ",   \
  " ПО МТЗН3 Прямой",   \
  " ПО МТЗН3 Обр.  ",   \
  "  ПО U МТЗПН3   ",   \
  "   ПО МТЗПН3    ",   \
  "      МТЗ3      ",   \
  " Сект.МТЗН4 Пр. ",   \
  " Сект.МТЗН4 Обр.",   \
  "    ПО МТЗ4     ",   \
  " ПО МТЗН4 Прямой",   \
  " ПО МТЗН4 Обр.  ",   \
  "  ПО U МТЗПН4   ",   \
  "   ПО МТЗПН4    ",   \
  "      МТЗ4      ",   \
  " ПО блок.U МТЗН ",   \
  "    НЦН-МТЗ     ",   \
  "Блок.МТЗ 0.4кВ 1",   \
  "Блок.МТЗ 0.4кВ 2",   \
  "Бл.у.МТЗ 0.4кВ 2",   \
  " ПО МТЗ 0.4кВ 1 ",   \
  "  МТЗ 0.4кВ 1   ",   \
  " ПО МТЗ 0.4кВ 2 ",   \
  "  МТЗ 0.4кВ 2   ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ от ДВ ",   \
  " Свет ЗДЗ от ДВ ",   \
  "Свет ЗДЗ от ОВД1",   \
  "Свет ЗДЗ от ОВД2",   \
  "Свет ЗДЗ от ОВД3",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.НЗЗ    ",   \
  "     ПО НЗЗ     ",   \
  "      НЗЗ       ",   \
  "   ПО ЗЗ(3I0)   ",   \
  "    ЗЗ(3I0)     ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор НЗЗ   ",   \
  "   Блок.ТЗНП1   ",   \
  " Сект.ТЗНП1 Пр. ",   \
  " Сект.ТЗНП1 Обр.",   \
  "ПО 3I0 ТЗНП1 Пр.",   \
  "ПО 3I0 ТЗНП1 Обр",   \
  "ПО 3U0 ТЗНП1 Пр.",   \
  "ПО 3U0 ТЗНП1 Обр",   \
  "  ПО ТЗНП1 Пр.  ",   \
  " ПО ТЗНП1 Обр.  ",   \
  "     ТЗНП1      ",   \
  "   Блок.ТЗНП2   ",   \
  " Сект.ТЗНП2 Пр. ",   \
  " Сект.ТЗНП2 Обр.",   \
  "ПО 3I0 ТЗНП2 Пр.",   \
  "ПО 3I0 ТЗНП2 Обр",   \
  "ПО 3U0 ТЗНП2 Пр.",   \
  "ПО 3U0 ТЗНП2 Обр",   \
  "  ПО ТЗНП2 Пр.  ",   \
  " ПО ТЗНП2 Обр.  ",   \
  "     ТЗНП2      ",   \
  "   Блок.ТЗНП3   ",   \
  " Сект.ТЗНП3 Пр. ",   \
  " Сект.ТЗНП3 Обр.",   \
  "ПО 3I0 ТЗНП3 Пр.",   \
  "ПО 3I0 ТЗНП3 Обр",   \
  "ПО 3U0 ТЗНП3 Пр.",   \
  "ПО 3U0 ТЗНП3 Обр",   \
  "  ПО ТЗНП3 Пр.  ",   \
  " ПО ТЗНП3 Обр.  ",   \
  "     ТЗНП3      ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "      АПВ2      ",   \
  "      АПВ3      ",   \
  "      АПВ4      ",   \
  "   Работа АПВ   ",   \
  " АЧР/ЧАПВ от ДВ ",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "   Разр.ЧАПВ    ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР1     ",   \
  "    ПО ЧАПВ1    ",   \
  "   АЧР/ЧАПВ1    ",   \
  "    ПО АЧР2     ",   \
  "    ПО ЧАПВ2    ",   \
  "   АЧР/ЧАПВ2    ",   \
  " Пуск УРОВ от ДВ",   \
  "    ПО УРОВ     ",   \
  "     УРОВ1      ",   \
  "     УРОВ2      ",   \
  " Блок.ЗОП(КОФ)  ",   \
  "  ПО ЗОП(КОФ)   ",   \
  "    ЗОП(КОФ)    ",   \
  "  Блок.ЗНмин1   ",   \
  "  Пуск ЗНмин1   ",   \
  "  Блок.ЗНмин2   ",   \
  "  Пуск ЗНмин2   ",   \
  "   ПО ЗНмин1    ",   \
  " ПО Uблк.ЗНмин1 ",   \
  " ПО Iблк.ЗНмин1 ",   \
  "     ЗНмин1     ",   \
  "     ПО ЗНмин2  ",   \
  " ПО Uблк.ЗНмин2 ",   \
  " ПО Iблк.ЗНмин2 ",   \
  "     ЗНмин2     ",   \
  "  Блок.ЗНмакс1  ",   \
  "   ПО ЗНмакс1   ",   \
  "    ЗНмакс1     ",   \
  "  Блок.ЗНмакс2  ",   \
  "   ПО ЗНмакс2   ",   \
  "    ЗНмакс2     ",   \
  "    Блок.УЗx    ",   \
  "     ПО УЗx     ",   \
  "      УЗx       ",   \
  " Вх.О-функции1  ",   \
  " Вых.О-функции1 ",   \
  " Вх.О-функции2  ",   \
  " Вых.О-функции2 ",   \
  " Вх.О-функции3  ",   \
  " Вых.О-функции3 ",   \
  " Вх.О-функции4  ",   \
  " Вых.О-функции4 ",   \
  " Вх.О-функции5  ",   \
  " Вых.О-функции5 ",   \
  " Вх.О-функции6  ",   \
  " Вых.О-функции6 ",   \
  " Вх.О-функции7  ",   \
  " Вых.О-функции7 ",   \
  " Вх.О-функции8  ",   \
  " Вых.О-функции8 ",   \
  " Уст.О-триггера1",   \
  " Сбр.О-триггера1",   \
  " Вых.О-триггера1",   \
  " Уст.О-триггера2",   \
  " Сбр.О-триггера2",   \
  " Вых.О-триггера2",   \
  " Уст.О-триггера3",   \
  " Сбр.О-триггера3",   \
  " Вых.О-триггера3",   \
  " Уст.О-триггера4",   \
  " Сбр.О-триггера4",   \
  " Вых.О-триггера4",   \
  "      О-И1      ",   \
  "      О-И2      ",   \
  "      О-И3      ",   \
  "      О-И4      ",   \
  "      О-И5      ",   \
  "      О-И6      ",   \
  "      О-И7      ",   \
  "      О-И8      ",   \
  "     О-ИЛИ1     ",   \
  "     О-ИЛИ2     ",   \
  "     О-ИЛИ3     ",   \
  "     О-ИЛИ4     ",   \
  "     О-ИЛИ5     ",   \
  "     О-ИЛИ6     ",   \
  "     О-ИЛИ7     ",   \
  "     О-ИЛИ8     ",   \
  "  О-Искл.ИЛИ1   ",   \
  "  О-Искл.ИЛИ2   ",   \
  "  О-Искл.ИЛИ3   ",   \
  "  О-Искл.ИЛИ4   ",   \
  "  О-Искл.ИЛИ5   ",   \
  "  О-Искл.ИЛИ6   ",   \
  "  О-Искл.ИЛИ7   ",   \
  "  О-Искл.ИЛИ8   ",   \
  "     О-НЕ1      ",   \
  "     О-НЕ2      ",   \
  "     О-НЕ3      ",   \
  "     О-НЕ4      ",   \
  "     О-НЕ5      ",   \
  "     О-НЕ6      ",   \
  "     О-НЕ7      ",   \
  "     О-НЕ8      ",   \
  "     О-НЕ9      ",   \
  "     О-НЕ10     ",   \
  "     О-НЕ11     ",   \
  "     О-НЕ12     ",   \
  "     О-НЕ13     ",   \
  "     О-НЕ14     ",   \
  "     О-НЕ15     ",   \
  "     О-НЕ16     ",   \
  " Ош.настр.р.лог."

#define NAME_RANG_UA    \
  " Блок.ввімкн.ВВ ",   \
  " Скид.індикації ",   \
  "   Скид.реле    ",   \
  " Місц./Дистанц. ",   \
  "    Стан ВВ     ",   \
  "Вимк.від зовн.з.",   \
  "    Ввімк.ВВ    ",   \
  " Контроль Ввімк.",   \
  "    Вимк.ВВ     ",   \
  " Контроль Вимк. ",   \
  "   Привід ВВ    ",   \
  " Перев.Iв.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Вич.Ресурс ВВ  ",   \
  " Неспр.Загальна ",   \
  "  Неспр.Авар.   ",   \
  " Роб.Ан.Реєстр. ",   \
  " Роб.Д.Реєстр.  ",   \
  " Вимк.від зах.  ",   \
  "     БВимк.     ",   \
  "    БВвімк.     ",   \
  " 1-а гр.уставок ",   \
  " 2-а гр.уставок ",   \
  " 3-а гр.уставок ",   \
  " 4-а гр.уставок ",   \
  " Інв.ДВ гр.уст. ",   \
  "Бл.гр.уст.від з.",   \
  " С.блк.Гот.до ТУ",   \
  "Готовність до ТУ",   \
  " Зм.налаштування",   \
  " Блок.Вх.GOOSExx",   \
  "  Блок.Вх.MMSx  ",   \
  "   Блок.ВМБx    ",   \
  "   Блок.МСЗ1    ",   \
  "   Блок.МСЗ2    ",   \
  " Блок.приск.МСЗ2",   \
  "   Блок.МСЗ3    ",   \
  "   Блок.МСЗ4    ",   \
  " Сект.МСЗН1 Пр. ",   \
  " Сект.МСЗН1 Зв. ",   \
  "    ПО МСЗ1     ",   \
  "  ПО МСЗН1 Пр.  ",   \
  "  ПО МСЗН1 Зв.  ",   \
  "  ПО U МСЗПН1   ",   \
  "   ПО МСЗПН1    ",   \
  "      МСЗ1      ",   \
  " Сект.МСЗН2 Пр. ",   \
  " Сект.МСЗН2 Зв. ",   \
  "    ПО МСЗ2     ",   \
  "  ПО МСЗН2 Пр.  ",   \
  "  ПО МСЗН2 Зв.  ",   \
  "  ПО U МСЗПН2   ",   \
  "   ПО МСЗПН2    ",   \
  "      МСЗ2      ",   \
  " Сект.МСЗН3 Пр. ",   \
  " Сект.МСЗН3 Зв. ",   \
  "    ПО МСЗ3     ",   \
  "  ПО МСЗН3 Пр.  ",   \
  "  ПО МСЗН3 Зв.  ",   \
  "  ПО U МСЗПН3   ",   \
  "   ПО МСЗПН3    ",   \
  "      МСЗ3      ",   \
  " Сект.МСЗН4 Пр. ",   \
  " Сект.МСЗН4 Зв. ",   \
  "    ПО МСЗ4     ",   \
  "  ПО МСЗН4 Пр.  ",   \
  "  ПО МСЗН4 Зв.  ",   \
  "  ПО U МСЗПН4   ",   \
  "   ПО МСЗПН4    ",   \
  "      МСЗ4      ",   \
  " ПО блок.U МСЗН ",   \
  "    НКН-МСЗ     ",   \
  "Блок.МСЗ 0.4кВ 1",   \
  "Блок.МСЗ 0.4кВ 2",   \
  "Бл.п.МСЗ 0.4кВ 2",   \
  " ПО МСЗ 0.4кВ 1 ",   \
  "  МСЗ 0.4кВ 1   ",   \
  " ПО МСЗ 0.4кВ 2 ",   \
  "  МСЗ 0.4кВ 2   ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ від ДВ",   \
  " Св.ЗДЗ від ДВ  ",   \
  " Св.ЗДЗ від ОВД1",   \
  " Св.ЗДЗ від ОВД2",   \
  " Св.ЗДЗ від ОВД3",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.НЗЗ    ",   \
  "     ПО НЗЗ     ",   \
  "      НЗЗ       ",   \
  "   ПО ЗЗ(3I0)   ",   \
  "    ЗЗ(3I0)     ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор НЗЗ   ",   \
  "   Блок.СЗНП1   ",   \
  " Сект.СЗНП1 Пр. ",   \
  " Сект.СЗНП1 Зв. ",   \
  "ПО 3I0 СЗНП1 Пр.",   \
  "ПО 3I0 СЗНП1 Зв.",   \
  "ПО 3U0 СЗНП1 Пр.",   \
  "ПО 3U0 СЗНП1 Зв.",   \
  "  ПО СЗНП1 Пр.  ",   \
  "  ПО СЗНП1 Зв.  ",   \
  "     СЗНП1      ",   \
  "   Блок.СЗНП2   ",   \
  " Сект.СЗНП2 Пр. ",   \
  " Сект.СЗНП2 Зв. ",   \
  "ПО 3I0 СЗНП2 Пр.",   \
  "ПО 3I0 СЗНП2 Зв.",   \
  "ПО 3U0 СЗНП2 Пр.",   \
  "ПО 3U0 СЗНП2 Зв.",   \
  "  ПО СЗНП2 Пр.  ",   \
  "  ПО СЗНП2 Зв.  ",   \
  "     СЗНП2      ",   \
  "   Блок.СЗНП3   ",   \
  " Сект.СЗНП3 Пр. ",   \
  " Сект.СЗНП3 Зв. ",   \
  "ПО 3I0 СЗНП3 Пр.",   \
  "ПО 3I0 СЗНП3 Зв.",   \
  "ПО 3U0 СЗНП3 Пр.",   \
  "ПО 3U0 СЗНП3 Зв.",   \
  "  ПО СЗНП3 Пр.  ",   \
  "  ПО СЗНП3 Зв.  ",   \
  "     СЗНП3      ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "      АПВ2      ",   \
  "      АПВ3      ",   \
  "      АПВ4      ",   \
  "   Робота АПВ   ",   \
  " АЧР/ЧАПВ від ДВ",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "  Дозвіл ЧАПВ   ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР1     ",   \
  "    ПО ЧАПВ1    ",   \
  "   АЧР/ЧАПВ1    ",   \
  "    ПО АЧР2     ",   \
  "    ПО ЧАПВ2    ",   \
  "   АЧР/ЧАПВ2    ",   \
  "Пуск ПРВВ від ДВ",   \
  "    ПО ПРВВ     ",   \
  "     ПРВВ1      ",   \
  "     ПРВВ2      ",   \
  " Блок.ЗЗП(КОФ)  ",   \
  "  ПО ЗЗП(КОФ)   ",   \
  "    ЗЗП(КОФ)    ",   \
  "  Блок.ЗНмін1   ",   \
  "  Пуск ЗНмін1   ",   \
  "  Блок.ЗНмін2   ",   \
  "  Пуск ЗНмін2   ",   \
  "   ПО ЗНмін1    ",   \
  " ПО Uблк.ЗНмін1 ",   \
  " ПО Iблк.ЗНмін1 ",   \
  "     ЗНмін1     ",   \
  "     ПО ЗНмін2  ",   \
  " ПО Uблк.ЗНмін2 ",   \
  " ПО Iблк.ЗНмін2 ",   \
  "     ЗНмін2     ",   \
  "  Блок.ЗНмакс1  ",   \
  "   ПО ЗНмакс1   ",   \
  "    ЗНмакс1     ",   \
  "  Блок.ЗНмакс2  ",   \
  "   ПО ЗНмакс2   ",   \
  "    ЗНмакс2     ",   \
  "    Блок.УЗx    ",   \
  "     ПО УЗx     ",   \
  "      УЗx       ",   \
  " Вх.В-функції1  ",   \
  " Вих.В-функції1 ",   \
  " Вх.В-функції2  ",   \
  " Вих.В-функції2 ",   \
  " Вх.В-функції3  ",   \
  " Вих.В-функції3 ",   \
  " Вх.В-функції4  ",   \
  " Вих.В-функції4 ",   \
  " Вх.В-функції5  ",   \
  " Вих.В-функції5 ",   \
  " Вх.В-функції6  ",   \
  " Вих.В-функції6 ",   \
  " Вх.В-функції7  ",   \
  " Вих.В-функції7 ",   \
  " Вх.В-функції8  ",   \
  " Вих.В-функції8 ",   \
  " Вст.В-триґера1 ",   \
  " Ск.В-триґера1  ",   \
  " Вих.В-триґера1 ",   \
  " Вст.В-триґера2 ",   \
  " Ск.В-триґера2  ",   \
  " Вих.В-триґера2 ",   \
  " Вст.В-триґера3 ",   \
  " Ск.В-триґера3  ",   \
  " Вих.В-триґера3 ",   \
  " Вст.В-триґера4 ",   \
  " Ск.В-триґера4  ",   \
  " Вих.В-триґера4 ",   \
  "      В-І1      ",   \
  "      В-І2      ",   \
  "      В-І3      ",   \
  "      В-І4      ",   \
  "      В-І5      ",   \
  "      В-І6      ",   \
  "      В-І7      ",   \
  "      В-І8      ",   \
  "     В-АБО1     ",   \
  "     В-АБО2     ",   \
  "     В-АБО3     ",   \
  "     В-АБО4     ",   \
  "     В-АБО5     ",   \
  "     В-АБО6     ",   \
  "     В-АБО7     ",   \
  "     В-АБО8     ",   \
  "  В-Викл.АБО1   ",   \
  "  В-Викл.АБО2   ",   \
  "  В-Викл.АБО3   ",   \
  "  В-Викл.АБО4   ",   \
  "  В-Викл.АБО5   ",   \
  "  В-Викл.АБО6   ",   \
  "  В-Викл.АБО7   ",   \
  "  В-Викл.АБО8   ",   \
  "     В-НЕ1      ",   \
  "     В-НЕ2      ",   \
  "     В-НЕ3      ",   \
  "     В-НЕ4      ",   \
  "     В-НЕ5      ",   \
  "     В-НЕ6      ",   \
  "     В-НЕ7      ",   \
  "     В-НЕ8      ",   \
  "     В-НЕ9      ",   \
  "     В-НЕ10     ",   \
  "     В-НЕ11     ",   \
  "     В-НЕ12     ",   \
  "     В-НЕ13     ",   \
  "     В-НЕ14     ",   \
  "     В-НЕ15     ",   \
  "     В-НЕ16     ",   \
  " Пом.нал.р.лог. "
    
#define NAME_RANG_EN    \
  "  CB Close Blk  ",   \
  "   LED Reset    ",   \
  "  Relay Reset   ",   \
  "  Local/Remote  ",   \
  "    CB State    ",   \
  " Ext CB Open Cmd",   \
  "  Close CB Cmd  ",   \
  " CB Op Circ Ctl ",   \
  "  Open CB Cmd   ",   \
  " CB Cl Circ Ctl ",   \
  "  CB Actuator   ",   \
  "Rat Trip Cur Exc",   \
  "  CB crit res   ",   \
  "   CB res exh   ",   \
  " General fault  ",   \
  " Emergence Fault",   \
  " Dst Rec InPro  ",   \
  " Bin Rec InPro  ",   \
  " Trip via Prot  ",   \
  "  Open CB Com   ",   \
  "  Close CB Com  ",   \
  " SetPoints gr-1 ",   \
  " SetPoints gr-2 ",   \
  " SetPoints gr-3 ",   \
  " SetPoints gr-4 ",   \
  "SP gr chg BI pre",   \
  " SP gr chg Blk  ",   \
  "Rem Ctr R Bl Res",   \
  "  Rem Ctl Ena   ",   \
  " Settings change",   \
  " GSERECEIVxx Blk",   \
  " MMSRECEIVxx Blk",   \
  " NETSENDxx Blk  ",   \
  "    OCP1 Blk    ",   \
  "    OCP2 Blk    ",   \
  "  OCP2 Acc Blk  ",   \
  "    OCP3 Blk    ",   \
  "    OCP4 Blk    ",   \
  "  DOCP1 Fw Sec  ",   \
  "  DOCP1 Bw Sec  ",   \
  "   OCP1 Start   ",   \
  " DOCP1 Fw Start ",   \
  " DOCP1 Bw Start ",   \
  " VOCP1 U Start  ",   \
  "  VOCP1 Start   ",   \
  "    OCP1 Op     ",   \
  "  DOCP2 Fw Sec  ",   \
  "  DOCP2 Bw Sec  ",   \
  "   OCP2 Start   ",   \
  " DOCP2 Fw Start ",   \
  " DOCP2 Bw Start ",   \
  " VOCP2 U Start  ",   \
  "  VOCP2 Start   ",   \
  "    OCP2 Op     ",   \
  "  DOCP3 Fw Sec  ",   \
  "  DOCP3 Bw Sec  ",   \
  "   OCP3 Start   ",   \
  " DOCP3 Fw Start ",   \
  " DOCP3 Bw Start ",   \
  " VOCP3 U Start  ",   \
  "  VOCP3 Start   ",   \
  "    OCP3 Op     ",   \
  "  DOCP4 Fw Sec  ",   \
  "  DOCP4 Bw Sec  ",   \
  "   OCP4 Start   ",   \
  " DOCP4 Fw Start ",   \
  " DOCP4 Bw Start ",   \
  " VOCP4 U Start  ",   \
  "  VOCP4 Start   ",   \
  "    OCP4 Op     ",   \
  "   OCP U Blk    ",   \
  " OCP U Malfunc  ",   \
  "   LVOCP1 Blk   ",   \
  "   LVOCP2 Blk   ",   \
  " LVOCP2 acc Blk ",   \
  "  LVOCP1 Start  ",   \
  "   LVOCP1 Op    ",   \
  "  LVOCP2 Start  ",   \
  "   LVOCP2 Op    ",   \
  "    AFD Blk     ",   \
  "AFD via BI Start",   \
  " AFD via BI St  ",   \
  " AFD via LS1 St ",   \
  " AFD via LS2 St ",   \
  " AFD via LS3 St ",   \
  "   AFD Start    ",   \
  "     AFD Op     ",   \
  "   SDEFP Blk    ",   \
  "  SDEFP Start   ",   \
  "    SDEFP Op    ",   \
  "  SEFOCP Start  ",   \
  "   SEFOCP Op    ",   \
  "  SEFOVP Start  ",   \
  "   SEFOVP Op    ",   \
  "   SDEFP Sec    ",   \
  "   DEFP1 Blk    ",   \
  "  DEFP1 Sec Fw  ",   \
  "  DEFP1 Sec Bw  ",   \
  " DEFP3I01 Fw St ",   \
  " DEFP3I01 Bw St ",   \
  " DEFP3U01 Fw St ",   \
  " DEFP3U01 Bw St ",   \
  " DEFP1 Fw Start ",   \
  " DEFP1 Bw Start ",   \
  "    DEFP1 Op    ",   \
  "   DEFP2 Blk    ",   \
  "  DEFP2 Sec Fw  ",   \
  "  DEFP2 Sec Bw  ",   \
  " DEFP3I02 Fw St ",   \
  " DEFP3I02 Bw St ",   \
  " DEFP3U02 Fw St ",   \
  " DEFP3U02 Bw St ",   \
  " DEFP2 Fw Start ",   \
  " DEFP2 Bw Start ",   \
  "    DEFP2 Op    ",   \
  "   DEFP3 Blk    ",   \
  "  DEFP3 Sec Fw  ",   \
  "  DEFP3 Sec Bw  ",   \
  " DEFP3I03 Fw St ",   \
  " DEFP3I03 Bw St ",   \
  " DEFP3U03 Fw St ",   \
  " DEFP3U03 Bw St ",   \
  " DEFP3 Fw Start ",   \
  " DEFP3 Bw Start ",   \
  "    DEFP3 Op    ",   \
  "     AR Blk     ",   \
  "   AR Cycle 1   ",   \
  "   AR Cycle 2   ",   \
  "   AR Cycle 3   ",   \
  "   AR Cycle 4   ",   \
  "    AR InPro    ",   \
  " LFС/FAR vBI St ",   \
  "    LFС1 Blk    ",   \
  "    LFС2 Blk    ",   \
  "    FAR Ena     ",   \
  "    FAR Blk     ",   \
  "   LFС1 Start   ",   \
  "   FAR1 Start   ",   \
  "   LFС/FAR 1    ",   \
  "   LFС2 Start   ",   \
  "   FAR2 Start   ",   \
  "   LFС/FAR 2    ",   \
  " CBF vBI Start  ",   \
  "   CBF Start    ",   \
  "   CBF In Op    ",   \
  "   CBF Ex Op    ",   \
  "   NSOCP Blk    ",   \
  "  NSOCP Start   ",   \
  "    NSOCP Op    ",   \
  "    UVP1 Blk    ",   \
  " UVP1 vBI Start ",   \
  "    UVP2 Blk    ",   \
  " UVP2 vBI Start ",   \
  "   UVP1 Start   ",   \
  "   UVP1 UBlk    ",   \
  "   UVP1 IBlk    ",   \
  "    UVP1 Op     ",   \
  "   UVP2 Start   ",   \
  "   UVP2 UBlk    ",   \
  "   UVP2 IBlk    ",   \
  "    UVP2 Op     ",   \
  "    OVP1 Blk    ",   \
  "   OVP1 Start   ",   \
  "    OVP1 Op     ",   \
  "    OVP2 Blk    ",   \
  "   OVP2 Start   ",   \
  "    OVP2 Op     ",   \
  "   MFPx Block   ",   \
  "   MFPx Start   ",   \
  "      MFPx      ",   \
  "  UD-Func 1 In  ",   \
  " UD-Func 1 Out  ",   \
  "  UD-Func 2 In  ",   \
  " UD-Func 2 Out  ",   \
  "  UD-Func 3 In  ",   \
  " UD-Func 3 Out  ",   \
  "  UD-Func 4 In  ",   \
  " UD-Func 4 Out  ",   \
  "  UD-Func 5 In  ",   \
  " UD-Func 5 Out  ",   \
  "  UD-Func 6 In  ",   \
  " UD-Func 6 Out  ",   \
  "  UD-Func 7 In  ",   \
  " UD-Func 7 Out  ",   \
  "  UD-Func 8 In  ",   \
  " UD-Func 8 Out  ",   \
  "  UD-FF 1 Set   ",   \
  " UD-FF 1 Reset  ",   \
  "  UD-FF 1 Out   ",   \
  "  UD-FF 2 Set   ",   \
  " UD-FF 2 Reset  ",   \
  "  UD-FF 2 Out   ",   \
  "  UD-FF 3 Set   ",   \
  " UD-FF 3 Reset  ",   \
  "  UD-FF 3 Out   ",   \
  "  UD-FF 4 Set   ",   \
  " UD-FF 4 Reset  ",   \
  "  UD-FF 4 Out   ",   \
  "     AND 1      ",   \
  "     AND 2      ",   \
  "     AND 3      ",   \
  "     AND 4      ",   \
  "     AND 5      ",   \
  "     AND 6      ",   \
  "     AND 7      ",   \
  "     AND 8      ",   \
  "      OR 1      ",   \
  "      OR 2      ",   \
  "      OR 3      ",   \
  "      OR 4      ",   \
  "      OR 5      ",   \
  "      OR 6      ",   \
  "      OR 7      ",   \
  "      OR 8      ",   \
  "     XOR 1      ",   \
  "     XOR 2      ",   \
  "     XOR 3      ",   \
  "     XOR 4      ",   \
  "     XOR 5      ",   \
  "     XOR 6      ",   \
  "     XOR 7      ",   \
  "     XOR 8      ",   \
  "     NOT 1      ",   \
  "     NOT 2      ",   \
  "     NOT 3      ",   \
  "     NOT 4      ",   \
  "     NOT 5      ",   \
  "     NOT 6      ",   \
  "     NOT 7      ",   \
  "     NOT 8      ",   \
  "     NOT 9      ",   \
  "     NOT 10     ",   \
  "     NOT 11     ",   \
  "     NOT 12     ",   \
  "     NOT 13     ",   \
  "     NOT 14     ",   \
  "     NOT 15     ",   \
  "     NOT 16     ",   \
  "  UD-Logic Er   "

#define NAME_RANG_KZ    \
  "  Блок.вкл.ВВ   ",   \
  " Сброс индикации",   \
  "   Сброс реле   ",   \
  " Местн./Дистанц.",   \
  "  Положение ВВ  ",   \
  "Откл.от вн.защит",   \
  "     Вкл.ВВ     ",   \
  " Контроль Вкл.  ",   \
  "    Откл.ВВ     ",   \
  " Контроль Откл. ",   \
  "   Привод ВВ    ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Исч.Ресурс ВВ  ",   \
  "  Неиспр.Общая  ",   \
  "  Неиспр.Авар.  ",   \
  " Работа Ан.Рег. ",   \
  " Работа Д.Рег.  ",   \
  " Откл.от защит  ",   \
  "       БО       ",   \
  "       БВ       ",   \
  " 1-я гр.уставок ",   \
  " 2-я гр.уставок ",   \
  " 3-я гр.уставок ",   \
  " 4-я гр.уставок ",   \
  " Инв.ДВ гр.уст. ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "  Изм.настроек  ",   \
  " Блок.Вх.GOOSExx",   \
  "  Блок.Вх.MMSx  ",   \
  "   Блок.ВСБx    ",   \
  "   Блок.МТЗ1    ",   \
  "   Блок.МТЗ2    ",   \
  " Блок.уск.МТЗ2  ",   \
  "   Блок.МТЗ3    ",   \
  "   Блок.МТЗ4    ",   \
  " Сект.МТЗН1 Пр. ",   \
  " Сект.МТЗН1 Обр.",   \
  "    ПО МТЗ1     ",   \
  " ПО МТЗН1 Прямой",   \
  " ПО МТЗН1 Обр.  ",   \
  "  ПО U МТЗПН1   ",   \
  "   ПО МТЗПН1    ",   \
  "      МТЗ1      ",   \
  " Сект.МТЗН2 Пр. ",   \
  " Сект.МТЗН2 Обр.",   \
  "    ПО МТЗ2     ",   \
  " ПО МТЗН2 Прямой",   \
  " ПО МТЗН2 Обр.  ",   \
  "  ПО U МТЗПН2   ",   \
  "   ПО МТЗПН2    ",   \
  "      МТЗ2      ",   \
  " Сект.МТЗН3 Пр. ",   \
  " Сект.МТЗН3 Обр.",   \
  "    ПО МТЗ3     ",   \
  " ПО МТЗН3 Прямой",   \
  " ПО МТЗН3 Обр.  ",   \
  "  ПО U МТЗПН3   ",   \
  "   ПО МТЗПН3    ",   \
  "      МТЗ3      ",   \
  " Сект.МТЗН4 Пр. ",   \
  " Сект.МТЗН4 Обр.",   \
  "    ПО МТЗ4     ",   \
  " ПО МТЗН4 Прямой",   \
  " ПО МТЗН4 Обр.  ",   \
  "  ПО U МТЗПН4   ",   \
  "   ПО МТЗПН4    ",   \
  "      МТЗ4      ",   \
  " ПО блок.U МТЗН ",   \
  "    НЦН-МТЗ     ",   \
  "Блок.МТЗ 0.4кВ 1",   \
  "Блок.МТЗ 0.4кВ 2",   \
  "Бл.у.МТЗ 0.4кВ 2",   \
  " ПО МТЗ 0.4кВ 1 ",   \
  "  МТЗ 0.4кВ 1   ",   \
  " ПО МТЗ 0.4кВ 2 ",   \
  "  МТЗ 0.4кВ 2   ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ от ДВ ",   \
  " Свет ЗДЗ от ДВ ",   \
  "Свет ЗДЗ от ОВД1",   \
  "Свет ЗДЗ от ОВД2",   \
  "Свет ЗДЗ от ОВД3",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.НЗЗ    ",   \
  "     ПО НЗЗ     ",   \
  "      НЗЗ       ",   \
  "   ПО ЗЗ(3I0)   ",   \
  "    ЗЗ(3I0)     ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор НЗЗ   ",   \
  "   Блок.ТЗНП1   ",   \
  " Сект.ТЗНП1 Пр. ",   \
  " Сект.ТЗНП1 Обр.",   \
  "ПО 3I0 ТЗНП1 Пр.",   \
  "ПО 3I0 ТЗНП1 Обр",   \
  "ПО 3U0 ТЗНП1 Пр.",   \
  "ПО 3U0 ТЗНП1 Обр",   \
  "  ПО ТЗНП1 Пр.  ",   \
  " ПО ТЗНП1 Обр.  ",   \
  "     ТЗНП1      ",   \
  "   Блок.ТЗНП2   ",   \
  " Сект.ТЗНП2 Пр. ",   \
  " Сект.ТЗНП2 Обр.",   \
  "ПО 3I0 ТЗНП2 Пр.",   \
  "ПО 3I0 ТЗНП2 Обр",   \
  "ПО 3U0 ТЗНП2 Пр.",   \
  "ПО 3U0 ТЗНП2 Обр",   \
  "  ПО ТЗНП2 Пр.  ",   \
  " ПО ТЗНП2 Обр.  ",   \
  "     ТЗНП2      ",   \
  "   Блок.ТЗНП3   ",   \
  " Сект.ТЗНП3 Пр. ",   \
  " Сект.ТЗНП3 Обр.",   \
  "ПО 3I0 ТЗНП3 Пр.",   \
  "ПО 3I0 ТЗНП3 Обр",   \
  "ПО 3U0 ТЗНП3 Пр.",   \
  "ПО 3U0 ТЗНП3 Обр",   \
  "  ПО ТЗНП3 Пр.  ",   \
  " ПО ТЗНП3 Обр.  ",   \
  "     ТЗНП3      ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "      АПВ2      ",   \
  "      АПВ3      ",   \
  "      АПВ4      ",   \
  "   Работа АПВ   ",   \
  " АЧР/ЧАПВ от ДВ ",   \
  "   Блок.АЧР1    ",   \
  "   Блок.АЧР2    ",   \
  "   Разр.ЧАПВ    ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР1     ",   \
  "    ПО ЧАПВ1    ",   \
  "   АЧР/ЧАПВ1    ",   \
  "    ПО АЧР2     ",   \
  "    ПО ЧАПВ2    ",   \
  "   АЧР/ЧАПВ2    ",   \
  " Пуск УРОВ от ДВ",   \
  "    ПО УРОВ     ",   \
  "     УРОВ1      ",   \
  "     УРОВ2      ",   \
  " Блок.ЗОП(КОФ)  ",   \
  "  ПО ЗОП(КОФ)   ",   \
  "    ЗОП(КОФ)    ",   \
  "  Блок.ЗНмин1   ",   \
  "  Пуск ЗНмин1   ",   \
  "  Блок.ЗНмин2   ",   \
  "  Пуск ЗНмин2   ",   \
  "   ПО ЗНмин1    ",   \
  " ПО Uблк.ЗНмин1 ",   \
  " ПО Iблк.ЗНмин1 ",   \
  "     ЗНмин1     ",   \
  "     ПО ЗНмин2  ",   \
  " ПО Uблк.ЗНмин2 ",   \
  " ПО Iблк.ЗНмин2 ",   \
  "     ЗНмин2     ",   \
  "  Блок.ЗНмакс1  ",   \
  "   ПО ЗНмакс1   ",   \
  "    ЗНмакс1     ",   \
  "  Блок.ЗНмакс2  ",   \
  "   ПО ЗНмакс2   ",   \
  "    ЗНмакс2     ",   \
  "    Блок.УЗx    ",   \
  "     ПО УЗx     ",   \
  "      УЗx       ",   \
  " Вх.О-функции1  ",   \
  " Вых.О-функции1 ",   \
  " Вх.О-функции2  ",   \
  " Вых.О-функции2 ",   \
  " Вх.О-функции3  ",   \
  " Вых.О-функции3 ",   \
  " Вх.О-функции4  ",   \
  " Вых.О-функции4 ",   \
  " Вх.О-функции5  ",   \
  " Вых.О-функции5 ",   \
  " Вх.О-функции6  ",   \
  " Вых.О-функции6 ",   \
  " Вх.О-функции7  ",   \
  " Вых.О-функции7 ",   \
  " Вх.О-функции8  ",   \
  " Вых.О-функции8 ",   \
  " Уст.О-триггера1",   \
  " Сбр.О-триггера1",   \
  " Вых.О-триггера1",   \
  " Уст.О-триггера2",   \
  " Сбр.О-триггера2",   \
  " Вых.О-триггера2",   \
  " Уст.О-триггера3",   \
  " Сбр.О-триггера3",   \
  " Вых.О-триггера3",   \
  " Уст.О-триггера4",   \
  " Сбр.О-триггера4",   \
  " Вых.О-триггера4",   \
  "      О-И1      ",   \
  "      О-И2      ",   \
  "      О-И3      ",   \
  "      О-И4      ",   \
  "      О-И5      ",   \
  "      О-И6      ",   \
  "      О-И7      ",   \
  "      О-И8      ",   \
  "     О-ИЛИ1     ",   \
  "     О-ИЛИ2     ",   \
  "     О-ИЛИ3     ",   \
  "     О-ИЛИ4     ",   \
  "     О-ИЛИ5     ",   \
  "     О-ИЛИ6     ",   \
  "     О-ИЛИ7     ",   \
  "     О-ИЛИ8     ",   \
  "  О-Искл.ИЛИ1   ",   \
  "  О-Искл.ИЛИ2   ",   \
  "  О-Искл.ИЛИ3   ",   \
  "  О-Искл.ИЛИ4   ",   \
  "  О-Искл.ИЛИ5   ",   \
  "  О-Искл.ИЛИ6   ",   \
  "  О-Искл.ИЛИ7   ",   \
  "  О-Искл.ИЛИ8   ",   \
  "     О-НЕ1      ",   \
  "     О-НЕ2      ",   \
  "     О-НЕ3      ",   \
  "     О-НЕ4      ",   \
  "     О-НЕ5      ",   \
  "     О-НЕ6      ",   \
  "     О-НЕ7      ",   \
  "     О-НЕ8      ",   \
  "     О-НЕ9      ",   \
  "     О-НЕ10     ",   \
  "     О-НЕ11     ",   \
  "     О-НЕ12     ",   \
  "     О-НЕ13     ",   \
  "     О-НЕ14     ",   \
  "     О-НЕ15     ",   \
  "     О-НЕ16     ",   \
  " Ош.настр.р.лог."
    
#endif 
